{"meta":{"title":"spurin.com","subtitle":"Personal site for James Spurin","description":"Covers a variety of topics","author":"James Spurin","url":"http://spurin.com","root":"/"},"pages":[{"title":"About spurin.com","date":"2019-02-28T22:28:24.000Z","updated":"2020-01-03T01:00:39.000Z","comments":true,"path":"about/index.html","permalink":"http://spurin.com/about/index.html","excerpt":"","text":"Howdy :)Hello and welcome to the personal site of James Spurin, those of you here may know me for a variety of different reasons. I’ve created this site as a soundboard for different areas that are of interest and of importance in my life. TechnologySince being in single digits, I’ve been into technology and my older brother’s rule of not being allowed to touch the ZX Spectrum was soon bypassed with the use of my grandmothers fingers as a ‘proxy’ to the keyboard. This passion continued throughout my youth, building computers at a young age and exploring all aspects of computing that I could find. In 1997, I started my professional career at Virgin Internet. Since then I’ve worked in a multitude of companies including Nomura, Goldman Sachs and even Lehman Brothers (leaving weeks before the collapse). I missed the University venture whilst I was young and instead, invested my time in a working career and the opportunities that were available within my vicinity, mostly professional courses and professional qualifications. This approach served me well and during which, I achieved the highest of certifications from companies such as Dell EMC, Sun Microsystems, HP and IBM. I still however, had a yearn for a University education. In 2007, I contacted the University of Liverpool after seeing an online advert for an online Masters programme that they were offering. My gut instinct was that this wouldn’t go too far given that my highest academic qualification at the time was a humble 8 GCSE’s. After a lengthy discussion I was asked to summarise my work qualifications and it was put to the board of Liverpool University for review. A few weeks went by and I was fortunate to be accepted onto the programme under a caveat that my progress would be reviewed for the first three modules, essentially, I was on probation. In 2010, I graduated with an MSc with Distinction in Computer Science - Software Engineering and was one of a handful to achieve the highest level for the programme. After learning a respectable means of software development than the self taught approach that I previously relied on, I became more involved in Open Source development and contribution. I developed an XML parser in Perl which was featured on perl.com - And later ported it to Python as xmldataset, where it made the Awesome Python list - I’ve contributed to other Open Source projects ranging from Synergy to ActiveMQ. Personally, I’m passionate about technology, whether its Software Development, Cryptocurrency, Automation, Storage, Cloud Computing, Kubernetes, Containers or anything else. More recently, wanting to pass on the benefit of knowledge and education, at the start of 2018 I created my first online course with ‘Packt Publishing’ called ‘Mastering Ansible’. It went on to become a best seller, has had over 5000 students and brought about a network of new friends. The course took me 3 months to write and is 11.5 hours, I’ll be talking about this both from a technical viewpoint and from a course development perspective. Disability‘I am Disabled’, a quote which for years I struggled with but have now got to grips with. It took a long time but eventually I managed to follow the motto of Henry Fraser and embrace his mantra of ‘Accept and Adapt’. I was moved by his resilience and motto and even bought the T-Shirt. For me the disability path was very difficult having experienced Disability Discrimination from a young age. I have an older brother as mentioned who’s disability started at 5 years old. With kids being kids, the use of Spastic and our surname was ingeniously put together on many occasions as an unsophisticated taunt. At the time I didn’t have a disability but that doesn’t mitigate this abuse. I was fine up until I was about 30 years old and then, I started catching my legs more and more often. I had, unfortunately injured my ankle after being too merry with friends and expected this to be a simple injury. You don’t really expect to be told that you have a type of Motor Neurone Disease called Hereditary Spastic Paraparesis. The condition I had seen in my brother turned out to be Hereditary. Whilst his diagnosis was Cerebral Palsy, my Neurologists believed that it was more likely to be HSP like my own. As time progressed, the disability progressed from the point where I would receive a question such as ‘have you hurt your leg’ to ‘do you have a limp’, then, to ‘have you had polio’ and ‘whats your disability’. At present I walk with a difficult gait. For years I studied this disease and learnt every aspect I could about it, mostly in the hope for a cure or some way out of this predicament. Unfortunately, with this disease it is something that you manage, there is no ‘cure’. On these pages I’ll be writing about this experience, how individuals in the same predicament can effectively manage their diagnosis, steps to ensure they get the most accurate diagnosis and options for managing the condition. There will be topics such as Disability Discrimination and the lighter side, of how to actually communicate with people effectively about disabilities (hint, humour is a great tool!). Selective Dorsal RhizotomyThis is one of the areas outside of technology that I am most passionate about in life and relates heavily to the topic of disability that I’ve detailed above. As highlighted, there is no cure at present for HSP (Hereditary Spastic Paraparesis) or conditions with similar pathologies such as Cerebral Palsy, but, the treatment of SDR (Selective Dorsal Rhizotomy) is a fantastic option and brings much benefit to the overall life quality of those disabled with either HSP or CP. Whilst the treatment has been available for Cerebral Palsy for a long time, it is now available also to those with the Pure form of Hereditary Spastic Paraparesis. I am the 22nd person in the world to receive this treatment for HSP in St Louis and am not aware, of any other hospitals that currently facilitate this, for HSP. Autism Spectrum Disorder &amp; Sensory Processing DisorderWorking in IT, I have a number of friends who have been diagnosed with a type of Autism Spectrum Disorder (formerly referred to as Aspergers). In an effort to be the best for them, I’ve researched and learnt about this and in time, have helped some overcome difficulties they faced in both general life and work. I also, have a daughter who has a rare type of ASD known as Sensory Processing Disorder, a subtype that is well researched and recognised in America but less so here in the UK. Through both research and time spent in America, we’ve learnt some valuable lessons and approaches for supporting the condition. Lastly, my wife, the real expert on this is undergoing her PhD in Child Psychology with an emphasis on Autism Spectrum Disorders so am regularly discussing a variety of areas in this space. Shoe MakingPrior to my disability and still somewhat, I have always had an eye and passion for footwear. In my younger years as an avid Oliver Sweeney fan, I would on most weekends, visit their lesser known Hammersmith shop looking to snap up pairs at a discount price. One day, whilst eating a Katsu Curry with a good friend, I saw a statue of a Cordweiner with a description plaque. It caught my attention and I wondered if there was anywhere in London that you could still learn this trade. I came across Paul Thomas Shoes and signed up for classes. Fearful of stepping into the world of elite fashion designers, I went along to a class to see how I faired (an IT person with zero fashion skills) … I loved it. After four years of part time work (2 hours per week), listening to Paul Thomas’s amazing music collection and interacting with a great crowd (an ex professional boxer who now has his own line of shoes - Tom Kilgallon, and a young lady featured in London Fashion Week - Gemma Roe). I designed and created from scratch, two pairs of shoes, which in itself was remarkable, giving the difficulties I faced with the sewing machines and my shaking legs (owing to clonus caused through spasticity from HSP). The result was these beauties. A pair of boots that I created for myself - And a pair I created for my wife, a twist on a pair that she had seen at an Edwardian museum with buttons that were taken from an old Edwardian Teddy Bear - Closing RemarksI hope you enjoy the site and for whatever reason you came here, find it useful. James Spurin"},{"title":"About spurin.com","date":"2019-02-28T22:28:24.000Z","updated":"2019-03-03T14:16:30.000Z","comments":true,"path":"about/index (r730's conflicted copy 2020-01-04).html","permalink":"http://spurin.com/about/index%20(r730's%20conflicted%20copy%202020-01-04).html","excerpt":"","text":"HowdyHello and welcome to the personal site of James Spurin, those of you here may know me for a variety of different reasons. I’ve created this site as a soundboard for different things that are of interest and of importance in my life. After speaking to many people about different topics, some of which as a complete suprise to the receiving party, I was regularly told to ‘Blog about it’. In time I hope to bring an array of different topics to this page which, may be of interest or use to others. Topics I’m likely to cover: TechnologySince being in single digits, I’ve been into technology and my olders brother’s rule of not being allowed to touch the ZX Spectrum was soon bypassed with the use of my grandmothers fingers as a ‘proxy’ to the keyboard. That passion continued throughout my youth, building computers at a young age, exploring all aspects of computing that I could find and then subsequently moving into a professional career in 1997 at Virgin Internet (yes those are grey whisps on the sides), since then I’ve worked in a multitude of companies including Nomura, Goldman Sachs and even the famous Lehman Brothers (leaving weeks before the collapse). I missed the University boat whilst younger and instead, invested in a career and the opportunites that were available within my vicinity, mostly professional courses and professional qualifications. This approach served me well and during which, I achieved the highest of certifications for companies such as Dell EMC, Sun Microsystems, HP and IBM. I still however … had a yearn for a University education … In 2007, I contacted the University of Liverpool after seeing an online advert for an online Masters programme that they were offering. My initial instict was that this wouldn’t go too far, given that my highest academic qualification prior, was, 8 GCSE’s. After a lengthy discussion with a very nice dutch member of staff I was asked to summarise my work qualifications and it would be put to the board for a review, given, that it was different to the backgrounds that they receive. A few weeks went by and I was fortunate to be accepted onto the programme under a caveat that my progress would be reviewed for the first three modules, essentially, I was on probation. In 2010, I graduated with an MSc with Distinction in Computer Science - Software Engineering and was one of a handful to achieve the highest level for the programme. After learning a more respectable way of software development than the self taught approach that I previously relied on, I became more involved in Open Source development and contribution. I developed an XML parser in Perl which was featured on perl.com - And later ported it to Python as xmldataset, where it made the Awesome Python list - I’ve contributed to other Open Source projects ranging from Synergy to ActiveMQ and sometimes, niche projects to help friends and family. Am passionate about technology, whether its Software Development, Cryptocurrency, Automation, Storage or Cloud Computing and enjoy working on a multitude of projects. More recently, wanting to pass on the benefit of knowledge and education, at the start of 2018 I created my first online course with ‘Packt Publishing’ called ‘Mastering Ansible’. It went on to become a best seller, has had over 3000 students and brought about a great network of new friends. The course took me 3 months to write, and is 11.5 hours, I’ll be talking about this both from a technical viewpoint and from a course development perspective. Disability‘I am Disabled’, a quote which for years I struggled with but have now got to grips with. It took a long time but eventually I managed to follow the motto of Henry Fraser and embrace ‘Accept and Adapt’, I was so moved by his resilience and motto that I bought one of his T-Shirts. For me the disability path was very difficult having been subject to Disability Discrimination from a young age. I have an older brother as mentioned previously who’s disability started in single digits. With kids being kids and not very creative, the use of Spastic and our surname was ingeniously put together on many occasions as an unsophisticated taunt. At the time I didn’t have a disability but that doesn’t always stop this behaviour. I was fine up until I was about 30 years old and then, I started catching my legs more and more often. I had, unfortunately injured my ankle after being too merry with friends and expected this to be a simple injury … you don’t really expect to be told that you have a type of Motor Neurone Disease called Hereditary Spastic Paraparesis. The condition I had seen in my brother turned out to be Hereditary. Whilst his diagnosis was Cerebral Palsy, my Neurologists believed that it was more likely to be HSP like my own. As time progressed, the disability progressed from the point where I would receive a question such as ‘have you hurt your leg’ to ‘do you have a limp’, then, to ‘have you had polio’ and ‘whats your disability’. At present I walk with a difficult gait. For years I studied this disease and learnt every aspect I could about it, mostly in the hope for a cure or some way out of this nightmare. Unfortunately, with this disease it is something that you manage, there is no ‘cure’ at present. On these pages I’ll be writing about this experience, how individuals in the same predicament can effectively manage their diagnosis, steps to ensure they get the most accurate diagnosis and options for managing the condition. There will be topics such as Disability Discrimination and the lighter side, of how to actually communicate with people effectively about disabilities, hint, humour is a great tool! Selective Dorsal RhizotomyThis is one of the areas outside of technology that I am most passionate about in life and relates heavily to the topic of disability that I’ve detailed above. As mentioned, there is no cure at present for HSP (Hereditary Spastic Paraparesis) or conditions with similar pathologies such as Cerebral Palsy, but, the treatment of SDR (Selective Dorsal Rhizotomy) is a fantastic option and brings much benefit to the overall life quality of those disabled with either HSP or CP. I will cover this topic in a lot more detail. Whilst the treatment has been available for Cerebral Palsy for a long time, it is now available also to those with the Pure form of Hereditary Spastic Paraparesis. I am the 22nd person in the world to receive this treatment for HSP in St Louis and am not aware, of any other hospitals that currently facilitate this, for HSP. Autism Spectrum Disorder &amp; Sensory Processing DisorderWorking in IT, I have a number of friends who have been diagnosed with a type of Autism Spectrum Disorder (formerly referred to as Aspergers). In an effort to be the best for them, I’ve researched and learnt about this and in time, have helped some overcome difficulties they faced in both general life and work. I also, have a daughter who has a rare type of ASD known as Sensory Processing Disorder, a subtype that is well researched and recognised in America but less so here in the UK. Through both research and time spent in America, we’ve learnt some valuable lessons and approaches for supporting the condition. I aim to share to the best of my ability some of the context here. Lastly, my wife, the real expert on this is undergoing her PhD in Child Psychology with an emphasis on Autism Spectrum Disorders so am regularly discussing a variety of areas in this space. Shoe MakingRather random but, prior to my disability and still somewhat, I have always had an eye and passion for footwear. In my younger years as an avid Oliver Sweeney fan, I would on most weekends, visit their lesser known Hammersmith shop looking to snap up pairs at a discount price. One day, whilst eating a Katsu Curry with a good friend, I saw a statue of a Cordweiner with a description plaque. It caught my attention and I wondered if there was anywhere in London that you could still learn this trade. I came across Paul Thomas Shoes and signed up for classes. Fearful of stepping into the world of fashion elite designers, I went along to a class to see how I faired … an IT person with zero fashion skills. I loved it. After four years of part time work (2 hours per week), listening to Paul Thomas’s amazing music collection, interacting with the most diverse crowd ever (an Ex Professional Boxer, a very outspoken Russian Girl and a now famous shoe designer to name a few…) I had designed and created from scratch, two pairs of shoes, which in itself was remarkable, giving the difficulties I faced with the sewing machines and my shaking legs (owing to the spasticity clonus). The result was these beauties - A pair of boots that I created for myself - A pair I created for my wife, a twist on a pair that she had seen at an Edwardian museum. The buttons, were taken from an old Edwardian Teddy Bear - I’ll be sharing more about the process, and the experience here. OtherSelf admittedly, I’m quite random … as you can see from these topics and there will be more of this random nature.I hope you enjoy the site and for whatever reason you came here, find it useful. James Spurin"}],"posts":[{"title":"Python IPC (Inter Process Communication)","slug":"Python-Inter-Process-Communication","date":"2020-06-25T20:39:51.000Z","updated":"2020-06-25T20:54:32.000Z","comments":true,"path":"2020/06/25/Python-Inter-Process-Communication/","link":"","permalink":"http://spurin.com/2020/06/25/Python-Inter-Process-Communication/","excerpt":"","text":"I’ve been experimenting with IPC (Inter Process Communication) in Python and as a result of this, have created samples that demonstrate how IPC can be implemented. They make use of the excellent multiprocessing module and have been documented both with comments and a per process logger (to show the interactions between processes). Added to GitHub. Hopefully if you’ve stumbled on this page, you’ll find them useful :) Examples include - FIFO (Named Pipe) Pipe RPC (Remote Procedure Call) Shared Memory Example Output (Fifo)INFO:parent:Pid:7383INFO:process1:Pid:7385INFO:process2:Pid:7386INFO:process1:Writing 1INFO:process1:Writing 2INFO:process1:Writing 3INFO:process1:Writing 4INFO:process2:Read: 1INFO:process1:Writing 5INFO:process2:Read: 2INFO:process2:Read: 3INFO:process1:Writing 6INFO:process2:Read: 4INFO:process1:Writing 7INFO:process2:Read: 5INFO:process1:Writing 8INFO:process2:Read: 6INFO:process1:Writing 9INFO:process2:Read: 7INFO:process1:Writing 10INFO:process2:Read: 8INFO:process1:Sleeping for 2INFO:process2:Read: 9INFO:process2:Read: 10INFO:process2:Finished process 2INFO:process1:Finished process 1","categories":[],"tags":[],"author":"James Spurin"},{"title":"CentOS added to Lab Docker Images with Web Terminal","slug":"CentOS-added-to-Lab-Web-Terminal-Images","date":"2020-06-22T20:58:34.000Z","updated":"2020-06-22T21:09:12.000Z","comments":true,"path":"2020/06/22/CentOS-added-to-Lab-Web-Terminal-Images/","link":"","permalink":"http://spurin.com/2020/06/22/CentOS-added-to-Lab-Web-Terminal-Images/","excerpt":"","text":"Recently I worked on some experimentation documented under Ubuntu Lab Docker Images with Web Terminal … In summary - Using a combination of Docker, Ubuntu, SSHD, TTYD and SupervisorD, I’ve created some handy docker images, available via Docker Hub that can be used for quickly spinning up Ubuntu testing/lab systems. The images are preconfigured with both SSHD and TTYD (for Web browser access) and can be configured further for a custom user account and ssh keys. These images, have now been updated to include both CentOS 7 and 8, respectively under the tags centos7 and centos8. Enjoy :)","categories":[],"tags":[],"author":"James Spurin"},{"title":"Ubuntu Lab Docker Images with Web Terminal","slug":"Ubuntu-Lab-Docker-Images-with-Web-Terminal","date":"2020-06-21T17:25:34.000Z","updated":"2020-06-26T19:26:28.000Z","comments":true,"path":"2020/06/21/Ubuntu-Lab-Docker-Images-with-Web-Terminal/","link":"","permalink":"http://spurin.com/2020/06/21/Ubuntu-Lab-Docker-Images-with-Web-Terminal/","excerpt":"","text":"Using a combination of Docker, Ubuntu, SSHD, TTYD and SupervisorD, I’ve created some handy docker images, available via Docker Hub that can be used for quickly spinning up Ubuntu testing/lab systems. The images are preconfigured with both SSHD and TTYD (for Web browser access) and can be configured further for a custom user account and ssh keys. Reference Links - https://github.com/spurin/docker-lab-linux-sshd-supervisord-ttyd https://hub.docker.com/r/spurin/docker-lab-linux-sshd-supervisord-ttyd OverviewUses supervisord to run both sshd and ttyd in a convenient container. sshd provides ssh connectivity. The daemon has been configured to allow root login and ssh keys can be autoconfigured on startup. ttyd provides a web based terminal, the image has also been customised to allow direct root login Default user of guest/guest is provided, can be overridden in the docker file or via environment variables Version TagsThis image provides various versions that are available via tags. latest tag usually provides a known stable version. Others are considered under development and caution must be exercised when using them. Tag Description latest Ubuntu 18.04 Bionic Beaver xenial Ubuntu 16.04 Xenial Xerus bionic Ubuntu 18.04 Bionic Beaver eoan Ubuntu 19.10 Eoan Ermie focal Ubuntu 20.04 Focal Fossa Examples (change :latest to the corresponding tag)Run with ssh port 23 (host) forwarding to 22 (container), can be accessed with users guest/guestor root/root docker run -p 23:22 spurin&#x2F;docker-lab-linux-sshd-supervisord-ttyd:latest Run with ttyd port 7681 (host) forwarding to 7681 (container), can be accessed via http://localhost:7681 docker run -p 7681:7681 spurin&#x2F;docker-lab-linux-sshd-supervisord-ttyd:latest Run with both sshd and ttyd forwarded docker run -p 23:22 -p 7681:7681 spurin&#x2F;docker-lab-linux-sshd-supervisord-ttyd:latest Change guest/guest to james/james # Create target dir, example uses &#x2F;Users&#x2F;james&#x2F;lab&#x2F;configecho james &gt; &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_nameecho james &gt; &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_passwdecho &#39;&#x2F;bin&#x2F;bash&#39; &gt; &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_shelldocker run -p 23:22 -p 7681:7681 -v &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config:&#x2F;config spurin&#x2F;docker-lab-linux-sshd-supervisord-ttyd:latest Use a volume for the users homedir # Create target dirs, example uses &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config and &#x2F;Users&#x2F;james&#x2F;lab&#x2F;homedirecho james &gt; &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_nameecho james &gt; &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_passwdecho &#39;&#x2F;bin&#x2F;bash&#39; &gt; &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_shelldocker run -p 23:22 -p 7681:7681 -v &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config:&#x2F;config -v &#x2F;Users&#x2F;james&#x2F;lab&#x2F;james_homedir:&#x2F;home&#x2F;james spurin&#x2F;docker-lab-linux-sshd-supervisord-ttyd:latest Specify SSH keys for user and root # Create target dirs, example uses &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config and &#x2F;Users&#x2F;james&#x2F;lab&#x2F;homedirecho james &gt; &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_nameecho james &gt; &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_passwdecho &#39;&#x2F;bin&#x2F;bash&#39; &gt; &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_shellssh-keygen -b 2048 -t rsa -f &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;guest_ssh -q -N &quot;&quot;ssh-keygen -b 2048 -t rsa -f &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config&#x2F;root_ssh -q -N &quot;&quot;docker run -p 23:22 -p 7681:7681 -v &#x2F;Users&#x2F;james&#x2F;lab&#x2F;config:&#x2F;config -v &#x2F;Users&#x2F;james&#x2F;lab&#x2F;james_homedir:&#x2F;home&#x2F;james spurin&#x2F;docker-lab-linux-sshd-supervisord-ttyd:latest","categories":[],"tags":[],"author":"James Spurin"},{"title":"Unexpected Fans with OpenSource Software","slug":"Unexpected-Fans-with-OpenSource-Software","date":"2020-06-17T17:27:06.000Z","updated":"2020-06-17T19:55:24.000Z","comments":true,"path":"2020/06/17/Unexpected-Fans-with-OpenSource-Software/","link":"","permalink":"http://spurin.com/2020/06/17/Unexpected-Fans-with-OpenSource-Software/","excerpt":"","text":"Three years ago, I embarked on an interesting effort where I needed to help my wife with an issue she was having with her University studies. As part of her research in studying Autism and Child Psychology, she makes extensive use of a program known as Tobii Studio Pro to analyze eye tracking data. Individuals watch videos on special eye tracking hardware and all their eye movements are captured for analysis. It is quite an incredible technology to watch and I recommend looking into this on the likes of YouTube if you’re intrigued. My wife uses this extensively, so much so that on occasion, she’s taken the program to its sheer limits in terms of the number of AOI’s (Areas of Interest, capture windows for eye movement) that you can use in a project. After spending months collecting data, an oversight was encountered where Tobii Studio would not allow the AOI data to be transferred from one project to another. In this instance, given the number of AOI’s, the exact XY placement for a frame and the moving of frames, many per second as the videos progresses, meant that recreating these AOI’s was quite simply in-practical. My wife had many projects, all with the same videos, all with many participants and data, and, all essentially needing exactly the same AOI’s for statistical analysis. In Tobii Studio, we found that there was an export functionality but, strangely, no way to import. A support case with Tobii yielded no solution and although this is a niche software offering, there were some threads outlining similar issues encountered (with no resolution). It was time to put the ethical hacker hat on :-) Tobii Studio project leverages SQLite to store the project information and with some simplified captures and a small subsection of AOI’s, a good weekend of tinkering and lots of trial and error, I was able to decode the process that Tobii studio used for managing Areas Of Interest. Off the back of this, a Python utility was created to facilitate the missing Tobii Studio AOI export/import functionality that the product desperately needs. Naturally, I put this on Github and with this, I really didn’t expect there to be that much (if any) interest, on such a specific piece of commercial software, on a specific problem, yet alone a product as niche as this is. …. 3 years later … Recently, I had to enhance this project with a ‘feature request’ from my wife with the ability to also transfer what is known as AOI groupings, buckets of AOI’s for analysis as part of the migration process. Again, this followed a similar path to the previous effort and eventually the pieces fell into place providing that satisfying eureka moment. It was then that I noticed, this project and the previous efforts, had been starred by six individuals and those predominately appear to be based in China… Given that many individuals frequent Github, and naturally, some consume without necessarily giving stars, it’s quite satisfying to find out that a couple of random weekends of effort, may have significantly helped individuals in far away countries with issues, where there was, literally no resolution but this. Throughout my career and my life, I’ve leant on OpenSource software and this for me is a great moment, albeit small, to see contributions as part of my ‘give back’ etiquette, appreciated :-) The link to the utility is here on GitHub","categories":[],"tags":[],"author":"James Spurin"},{"title":"Getting started with Apache Cassandra, Quickly","slug":"Getting-started-with-Cassandra-Quickly","date":"2020-06-16T23:15:32.000Z","updated":"2020-06-16T23:38:04.000Z","comments":true,"path":"2020/06/16/Getting-started-with-Cassandra-Quickly/","link":"","permalink":"http://spurin.com/2020/06/16/Getting-started-with-Cassandra-Quickly/","excerpt":"","text":"“The Apache Cassandra database is the right choice when you need scalability and high availability without compromising performance. Linear scalability and proven fault-tolerance on commodity hardware or cloud infrastructure make it the perfect platform for mission-critical data. Cassandra’s support for replicating across multiple datacenters is best-in-class, providing lower latency for your users and the peace of mind of knowing that you can survive regional outages.” The marketing is great, why wouldn’t you want to try this :-) This post gives a fast track overview for setting up Apache Cassandra with Docker, simulating a 3 DC x 2 rack cluster and some introductory commands to get started. Create/Recreate an Apache Cassandra Docker EnvironmentSEEDS&#x3D;&quot;&quot;# Cleanupfor dc in 1 2 3; do for rack in 1 2; do docker stop cassandra-dc$&#123;dc&#125;-rack$&#123;rack&#125; docker rm cassandra-dc$&#123;dc&#125;-rack$&#123;rack&#125; SEEDS&#x3D;$&#123;SEEDS&#125;,cassandra-dc$&#123;dc&#125;-rack$&#123;rack&#125; donedonedocker network remove cassandra-network# Remove leading commaSEEDS&#x3D;$(echo $SEEDS | cut -c2-)# Recreatedocker network create -d bridge cassandra-networkfor dc in 1 2 3; do for rack in 1 2; do docker run --name cassandra-dc$&#123;dc&#125;-rack$&#123;rack&#125; --network cassandra-network -d -e CASSANDRA_SEEDS&#x3D;$SEEDS -e CASSANDRA_DC&#x3D;DC$&#123;dc&#125; -e CASSANDRA_RACK&#x3D;RACK$&#123;rack&#125; -e CASSANDRA_ENDPOINT_SNITCH&#x3D;GossipingPropertyFileSnitch cassandra:latest donedone Show the nodes# docker ps -a | grep cassandra3bfeeba7a292 cassandra:latest &quot;docker-entrypoint.s…&quot; 29 seconds ago Up 25 seconds 7000-7001&#x2F;tcp, 7199&#x2F;tcp, 9042&#x2F;tcp, 9160&#x2F;tcp cassandra-dc3-rack26d71ef35b8b9 cassandra:latest &quot;docker-entrypoint.s…&quot; 32 seconds ago Up 28 seconds 7000-7001&#x2F;tcp, 7199&#x2F;tcp, 9042&#x2F;tcp, 9160&#x2F;tcp cassandra-dc3-rack13dd7ab91b59a cassandra:latest &quot;docker-entrypoint.s…&quot; 34 seconds ago Up 31 seconds 7000-7001&#x2F;tcp, 7199&#x2F;tcp, 9042&#x2F;tcp, 9160&#x2F;tcp cassandra-dc2-rack2dc11e49c374e cassandra:latest &quot;docker-entrypoint.s…&quot; 36 seconds ago Up 33 seconds 7000-7001&#x2F;tcp, 7199&#x2F;tcp, 9042&#x2F;tcp, 9160&#x2F;tcp cassandra-dc2-rack17e74b5b83142 cassandra:latest &quot;docker-entrypoint.s…&quot; 38 seconds ago Up 36 seconds 7000-7001&#x2F;tcp, 7199&#x2F;tcp, 9042&#x2F;tcp, 9160&#x2F;tcp cassandra-dc1-rack2ad55065d4f6e cassandra:latest &quot;docker-entrypoint.s…&quot; 40 seconds ago Up 38 seconds 7000-7001&#x2F;tcp, 7199&#x2F;tcp, 9042&#x2F;tcp, 9160&#x2F;tcp cassandra-dc1-rack1 Use one of the nodes# docker exec -it cassandra-dc3-rack2 bash Get cluster statusroot@3bfeeba7a292:&#x2F;# nodetool statusDatacenter: DC1&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.2 70.01 KiB 256 32.3% 06a3eabc-9e05-4c75-a8fb-bc01f6cec80c RACK1UN 172.28.0.3 70 KiB 256 32.1% 47bb39e8-7c5c-40f2-9688-28c4ab79c0c9 RACK2Datacenter: DC2&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.4 70.05 KiB 256 34.3% 726d1f71-6c83-4242-8187-5d041cc8b1dd RACK1UN 172.28.0.5 70.03 KiB 256 31.8% 8abe20cc-aadc-446c-bac8-7e82c203bbd5 RACK2Datacenter: DC3&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.6 70.04 KiB 256 36.3% 853a7c0a-d1b6-4e98-9788-a5eade445a31 RACK1UN 172.28.0.7 70.07 KiB 256 33.2% 1656459f-e3a7-4553-a5ef-d3be721cdb18 RACK2 Create keyspace with even replication distributioncqlsh&gt; CREATE KEYSPACE firstkeyspace WITH replication &#x3D; &#123;&#39;class&#39;: &#39;SimpleStrategy&#39;, &#39;replication_factor&#39;: 3&#125;;cqlsh&gt; use firstkeyspace ;cqlsh:firstkeyspace&gt; CREATE TABLE emp(emp_id int, emp_name text, emp_age int, PRIMARY KEY(emp_id));cqlsh:firstkeyspace&gt; CONSISTENCYCurrent consistency level is ONE.cqlsh:firstkeyspace&gt; CONSISTENCY ALLConsistency level set to ALL.cqlsh:firstkeyspace&gt; INSERT INTO emp (emp_id, emp_name, emp_age) VALUES(10, &#39;john&#39;, 28); Show distributionroot@3bfeeba7a292:&#x2F;# nodetool status firstkeyspaceDatacenter: DC1&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.2 92.01 KiB 256 48.5% 06a3eabc-9e05-4c75-a8fb-bc01f6cec80c RACK1UN 172.28.0.3 92 KiB 256 48.9% 47bb39e8-7c5c-40f2-9688-28c4ab79c0c9 RACK2Datacenter: DC2&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.4 92.05 KiB 256 51.1% 726d1f71-6c83-4242-8187-5d041cc8b1dd RACK1UN 172.28.0.5 92.03 KiB 256 47.9% 8abe20cc-aadc-446c-bac8-7e82c203bbd5 RACK2Datacenter: DC3&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.6 92.04 KiB 256 51.8% 853a7c0a-d1b6-4e98-9788-a5eade445a31 RACK1UN 172.28.0.7 92.07 KiB 256 51.7% 1656459f-e3a7-4553-a5ef-d3be721cdb18 RACK2 Create Keyspace with even unbalanced replication distributioncqlsh&gt; CREATE KEYSPACE secondkeyspace WITH replication &#x3D; &#123;&#39;class&#39;: &#39;SimpleStrategy&#39;, &#39;replication_factor&#39;: 4&#125;;cqlsh&gt; use secondkeyspace ;cqlsh:secondkeyspace&gt; CREATE TABLE emp(emp_id int, emp_name text, emp_age int, PRIMARY KEY(emp_id));cqlsh:secondkeyspace&gt; CONSISTENCY ALLConsistency level set to ALL.cqlsh:secondkeyspace&gt; INSERT INTO emp (emp_id, emp_name, emp_age) VALUES(10, &#39;john&#39;, 28);cqlsh:secondkeyspace&gt; Note the differenceroot@3bfeeba7a292:&#x2F;# nodetool status secondkeyspaceDatacenter: DC1&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.2 98.95 KiB 256 65.2% 06a3eabc-9e05-4c75-a8fb-bc01f6cec80c RACK1UN 172.28.0.3 98.94 KiB 256 64.3% 47bb39e8-7c5c-40f2-9688-28c4ab79c0c9 RACK2Datacenter: DC2&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.4 82.03 KiB 256 66.3% 726d1f71-6c83-4242-8187-5d041cc8b1dd RACK1UN 172.28.0.5 82.02 KiB 256 67.6% 8abe20cc-aadc-446c-bac8-7e82c203bbd5 RACK2Datacenter: DC3&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.6 82.04 KiB 256 66.3% 853a7c0a-d1b6-4e98-9788-a5eade445a31 RACK1UN 172.28.0.7 98.99 KiB 256 70.2% 1656459f-e3a7-4553-a5ef-d3be721cdb18 RACK2 Create Keyspace using all nodes and rackscqlsh&gt; CREATE KEYSPACE thirdkeyspace WITH replication &#x3D; &#123;&#39;class&#39;: &#39;NetworkTopologyStrategy&#39;, &#39;DC1&#39;: 2, &#39;DC2&#39;: 2, &#39;DC3&#39;: 2&#125;;cqlsh&gt; use thirdkeyspace;cqlsh:thirdkeyspace&gt; CONSISTENCY ALLConsistency level set to ALL.cqlsh:thirdkeyspace&gt; CREATE TABLE emp(emp_id int, emp_name text, emp_age int, PRIMARY KEY(emp_id));cqlsh:thirdkeyspace&gt; INSERT INTO emp (emp_id, emp_name, emp_age) VALUES(10, &#39;john&#39;, 28); All nodes, storing dataroot@3bfeeba7a292:&#x2F;# nodetool status thirdkeyspaceDatacenter: DC1&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.2 70.79 KiB 256 100.0% 06a3eabc-9e05-4c75-a8fb-bc01f6cec80c RACK1UN 172.28.0.3 70.79 KiB 256 100.0% 47bb39e8-7c5c-40f2-9688-28c4ab79c0c9 RACK2Datacenter: DC2&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.4 104.05 KiB 256 100.0% 726d1f71-6c83-4242-8187-5d041cc8b1dd RACK1UN 172.28.0.5 104.04 KiB 256 100.0% 8abe20cc-aadc-446c-bac8-7e82c203bbd5 RACK2Datacenter: DC3&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.6 104.06 KiB 256 100.0% 853a7c0a-d1b6-4e98-9788-a5eade445a31 RACK1UN 172.28.0.7 70.8 KiB 256 100.0% 1656459f-e3a7-4553-a5ef-d3be721cdb18 RACK2 Stop a node# docker stop cassandra-dc1-rack1cassandra-dc1-rack1 Note the DN Valueroot@r730:&#x2F;local&#x2F;docker&#x2F;cassandra# docker exec -it cassandra-dc3-rack2 bashroot@3bfeeba7a292:&#x2F;# nodetool status thirdkeyspaceDatacenter: DC1&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackDN 172.28.0.2 70.79 KiB 256 100.0% 06a3eabc-9e05-4c75-a8fb-bc01f6cec80c RACK1UN 172.28.0.3 70.79 KiB 256 100.0% 47bb39e8-7c5c-40f2-9688-28c4ab79c0c9 RACK2Datacenter: DC2&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.4 70.79 KiB 256 100.0% 726d1f71-6c83-4242-8187-5d041cc8b1dd RACK1UN 172.28.0.5 70.81 KiB 256 100.0% 8abe20cc-aadc-446c-bac8-7e82c203bbd5 RACK2Datacenter: DC3&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns (effective) Host ID RackUN 172.28.0.6 70.83 KiB 256 100.0% 853a7c0a-d1b6-4e98-9788-a5eade445a31 RACK1UN 172.28.0.7 70.8 KiB 256 100.0% 1656459f-e3a7-4553-a5ef-d3be721cdb18 RACK2 We can still query data by defaultroot@3bfeeba7a292:&#x2F;# cqlshConnected to Test Cluster at 127.0.0.1:9042.[cqlsh 5.0.1 | Cassandra 3.11.6 | CQL spec 3.4.4 | Native protocol v4]Use HELP for help.cqlsh&gt; USE thirdkeyspace ;cqlsh:thirdkeyspace&gt; select * from emp; emp_id | emp_age | emp_name--------+---------+---------- 10 | 28 | john But, with consistency all, it will fail for read/writescqlsh:thirdkeyspace&gt; CONSISTENCY ALLConsistency level set to ALL.cqlsh:thirdkeyspace&gt; select * from emp;NoHostAvailable:cqlsh:thirdkeyspace&gt; INSERT INTO emp (emp_id, emp_name, emp_age) VALUES(10, &#39;john2&#39;, 28);NoHostAvailable: Start back up the container, and wait for the cluster to resolve itself# docker start cassandra-dc1-rack1cassandra-dc1-rack1# docker exec -it cassandra-dc3-rack2 bashroot@3bfeeba7a292:&#x2F;# nodetool statusDatacenter: DC1&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns Host ID RackDN 172.28.0.2 70.79 KiB 256 ? 06a3eabc-9e05-4c75-a8fb-bc01f6cec80c RACK1UN 172.28.0.3 70.79 KiB 256 ? 47bb39e8-7c5c-40f2-9688-28c4ab79c0c9 RACK2Datacenter: DC2&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns Host ID RackUN 172.28.0.4 70.79 KiB 256 ? 726d1f71-6c83-4242-8187-5d041cc8b1dd RACK1UN 172.28.0.5 70.81 KiB 256 ? 8abe20cc-aadc-446c-bac8-7e82c203bbd5 RACK2Datacenter: DC3&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns Host ID RackUN 172.28.0.6 70.83 KiB 256 ? 853a7c0a-d1b6-4e98-9788-a5eade445a31 RACK1UN 172.28.0.7 70.8 KiB 256 ? 1656459f-e3a7-4553-a5ef-d3be721cdb18 RACK2Note: Non-system keyspaces don&#39;t have the same replication settings, effective ownership information is meaninglessroot@3bfeeba7a292:&#x2F;# nodetool statusDatacenter: DC1&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns Host ID RackUN 172.28.0.2 208.56 KiB 256 ? 06a3eabc-9e05-4c75-a8fb-bc01f6cec80c RACK1UN 172.28.0.3 70.79 KiB 256 ? 47bb39e8-7c5c-40f2-9688-28c4ab79c0c9 RACK2Datacenter: DC2&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns Host ID RackUN 172.28.0.4 70.79 KiB 256 ? 726d1f71-6c83-4242-8187-5d041cc8b1dd RACK1UN 172.28.0.5 70.81 KiB 256 ? 8abe20cc-aadc-446c-bac8-7e82c203bbd5 RACK2Datacenter: DC3&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;&#x3D;Status&#x3D;Up&#x2F;Down|&#x2F; State&#x3D;Normal&#x2F;Leaving&#x2F;Joining&#x2F;Moving-- Address Load Tokens Owns Host ID RackUN 172.28.0.6 70.83 KiB 256 ? 853a7c0a-d1b6-4e98-9788-a5eade445a31 RACK1UN 172.28.0.7 70.8 KiB 256 ? 1656459f-e3a7-4553-a5ef-d3be721cdb18 RACK2Note: Non-system keyspaces don&#39;t have the same replication settings, effective ownership information is meaningless Retry, with available replicasroot@3bfeeba7a292:&#x2F;# cqlshConnected to Test Cluster at 127.0.0.1:9042.[cqlsh 5.0.1 | Cassandra 3.11.6 | CQL spec 3.4.4 | Native protocol v4]Use HELP for help.cqlsh&gt; USE thirdkeyspace ;cqlsh:thirdkeyspace&gt; CONSISTENCY ALL;Consistency level set to ALL.cqlsh:thirdkeyspace&gt; select * from emp; emp_id | emp_age | emp_name--------+---------+---------- 10 | 28 | john(1 rows)cqlsh:thirdkeyspace&gt; INSERT INTO emp (emp_id, emp_name, emp_age) VALUES(10, &#39;john2&#39;, 28);cqlsh:thirdkeyspace&gt; select * from emp; emp_id | emp_age | emp_name--------+---------+---------- 10 | 28 | john2(1 rows)","categories":[],"tags":[],"author":"James Spurin"},{"title":"Creating a Blog/Website with Docker, Hexo & Github, Free Hosting and HTTPS","slug":"Creating-a-Blog-Website-with-Docker-Hexo-Github-Free-Hosting-and-HTTPS","date":"2020-01-04T15:30:00.000Z","updated":"2020-01-04T15:13:03.000Z","comments":true,"path":"2020/01/04/Creating-a-Blog-Website-with-Docker-Hexo-Github-Free-Hosting-and-HTTPS/","link":"","permalink":"http://spurin.com/2020/01/04/Creating-a-Blog-Website-with-Docker-Hexo-Github-Free-Hosting-and-HTTPS/","excerpt":"","text":"Updated for 2020. People often like to start a new year or even a new decade with a venture, blogging being particularly popular. I’ve updated this article originally written in 2019. The supporting container image used in this tutorial has been refactored and improved to handle persistency. Deployment keys are part of the build process and the context has been simplified. I hope you enjoy and find success in your goals :) TL;DR…This is a tutorial on creating a blog or website using hexo.io (a static site generator), Docker and Github with your own custom domain and https, for the cost of your domain name only and a little bit of time. IntroductionI wanted a convenient way of running sites, i.e. blogs and supporting sites for my projects, without a hosting service or server infrastructure like Wordpress, I also, wanted to keep this as cost effective as possible with free being an ideal. After comparing a multitude of offerings, I settled on the excellent hexo.io platform, ‘A fast, simple &amp; powerful blog framework’. The great thing about hexo, is that your blog/site is generated as a collection of static files. You don’t need anything other than a decent web server to host your page and given that it’s a static site, it reduces security concerns significantly in comparison to other popular blogging platforms. With the use of hexo, you’ve also got a means that you can work on your blog locally, without internet connectivity. If you’re like me and commute a lot, especially where there is intermittent wifi connectivity (London Underground), then this is particularly useful. The platform is built with node.js and subsequently, there are for it’s configuration, a variety of modules that need to be installed through npm. Whilst this is not that difficult in itself, it is a process that can result in a lot of installation residual on ones system. For this reason, we’re going to be using Docker to encapsulate the main blogging component that will run our system, keeping our own system shipshape and shiny. Github, offers a great solution for hosting sites with it’s pages.github.io service, all you need to have is a github account to make use of this. You can even, configure the service to leverage your own domain name, with Github taking care of aspects like https for you for free. PrerequisitesYou will need to have the following - Docker installation. Docker is available for Mac/Windows/Linux and is easily installed Domain Name (optional). I will be using a domain name for my configuration. If you wish to follow along fully, you’ll need a domain name but, you can just as easily stick with the free subdomain provided by Github pages, i.e. name.github.io, and skip the domain name related aspects in this tutorial. If you don’t have a domain name but wish to purchase one, name.com is an excellent provider and fits in well with this tutorial Github account, sign up for free on github.com OverviewIn the subsequent sections, we will be covering the complete setup of https://masteringansible.com, a domain I will be using to support my online course on Mastering Ansible Docker Pull the spurin/hexo ImageOn Docker Hub there is a pre-made image made by myself, containing the steps to install both Hexo and Hexo-Admin. More details about the image can be reviewed here. With docker installed, from a command prompt/terminal, issue the following command to pull the latest version of the image - $ docker pull spurin&#x2F;hexoUsing default tag: latestlatest: Pulling from spurin&#x2F;hexo804555ee0376: Pull complete2706bdf80250: Pull complete3a1861ab5a61: Pull complete2a2939395b29: Pull complete738ba111f3fd: Pull completec32fd6850012: Pull completed4c7abfc1ea7: Pull completeDigest: sha256:68df85373fa46d314b0fe1b8b278f8dc158342c711163b47fb4be780441b6fc6Status: Downloaded newer image for spurin&#x2F;hexo:latestdocker.io&#x2F;spurin&#x2F;hexo:latest Create a container for your siteAs we may have multiple sites, I like to give the running container a name that references the site that it relates too, so that I can easily see the container I wish to interact with. I also like to store the Docker volume that will relate to this, on Dropbox, so that I have a backup of my running configuration as most of my efforts in this space are performed on my personal laptop. The following example, assumes a domain name of masteringansible.com, with the local hexo server, running on port 4000. The -v ‘/Users/james/Dropbox/James/Application\\ Folders/docker/volumes/masteringansible.com’ is the path to where I will store the running configuration for the container. This command, creates a container for us using the customised spurin/hexo image as a base - $ docker create --name&#x3D;hexo-masteringansible.com \\-e HEXO_SERVER_PORT&#x3D;4001 \\-e GIT_USER&#x3D;&quot;James Spurin&quot; \\-e GIT_EMAIL&#x3D;&quot;james@abcdef.com&quot; \\-v &#x2F;Users&#x2F;james&#x2F;Dropbox&#x2F;James&#x2F;Application\\ Folders&#x2F;docker&#x2F;volumes&#x2F;masteringansible.com:&#x2F;app \\-p 4001:4001 \\spurin&#x2F;hexo We can start the container and follow the logs. When this runs for the first time, if a site does not exist in the target folder, one will be created (can take a while). Subsequently, hexo-admin will be installed inside the site. It will also create SSH keys for deployment, setup both github and gitlab as known_hosts and perform a gitconfig for your username and email - $ docker start hexo-masteringansible.com &amp;&amp; docker logs --follow hexo-masteringansible.comhexo-masteringansible.com***** App directory is empty, initialising with hexo and hexo-admin *****INFO Cloning hexo-starter https:&#x2F;&#x2F;github.com&#x2F;hexojs&#x2F;hexo-starter.gitCloning into &#39;&#x2F;app&#39;...Submodule &#39;themes&#x2F;landscape&#39; (https:&#x2F;&#x2F;github.com&#x2F;hexojs&#x2F;hexo-theme-landscape.git) registered for path &#39;themes&#x2F;landscape&#39;Cloning into &#39;&#x2F;app&#x2F;themes&#x2F;landscape&#39;...Submodule path &#39;themes&#x2F;landscape&#39;: checked out &#39;73a23c51f8487cfcd7c6deec96ccc7543960d350&#39;INFO Install dependenciesyarn install v1.21.1info No lockfile found.[1&#x2F;4] Resolving packages...[2&#x2F;4] Fetching packages...&lt;snip&gt;***** App directory contains no requirements.txt file, continuing ********** App .ssh directory is empty, initialising ssh key and configuring known_hosts for common git repositories (github&#x2F;gitlab) ********** Running git config, user &#x3D; James Spurin, email &#x3D; james@abcdef.com ********** Copying .ssh from App directory and setting permissions ********** Contents of public ssh key (for deploy) - *****ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2z5BbOk241XaNTALIlcHDF57WHQTvfA+NV8T7Puw5wk0hZExIWNZt0zfqD8m1XYWUYRlQbCx1wUMGRGOCHq5NtXlzQmCiDkBULXgoofC+&#x2F;8trD0p8pwzCPW8BZ4&#x2F;agRDIExdnaMD2Wqd8VCg&#x2F;1&#x2F;Y09QM3k5roiXPy7ES4ZCp5QHCbBJ1EXWjpgfn50o5pbq64Mgnw05lsAVbFjtSHm6Th+tN0IXbUvXO0znRvDTEJ15cG7uf9pI1rstCzydK0mqYDrOyqWYk&#x2F;aroJpnoJGnbT0AKnVoo3c5IS4w1SSY33Ju6G82QMjFOrPqqQPM3dNBIQHb2crRN+VxKpLAjMojfr root@b3feb661344f***** Starting server on port 4001 *****INFO Start processingINFO Hexo is running at http:&#x2F;&#x2F;localhost:4001 . Press Ctrl+C to stop. We can press Ctrl+C at this point without concern as we’re following the logs, the container is running in the background and thus our Ctrl+C stops the following of the logs, not the actual container. I’m performing this on my laptop so Docker is localhost, adjust the name/ip address accordingly if you’re running Docker elsewhere. If you browse to http://localhost:4001, you’ll be presented with a hexo starting page as follows - You can also, access the admin interface for hexo-admin at http://localhost:4001/admin - Customising the ThemeThis theme may suit your needs but personally, I am a big fan of the Hueman theme. The next steps cover the installation of this particular theme. Each theme will have their own requirements but this give an overall idea of the process. Execute a bash shell in the running container, giving you a prompt similar to the following - $ docker exec -it hexo-masteringansible.com bashroot@b3feb661344f:&#x2F;app# We will clone the theme from it’s source github repository, and whilst we’re in the shell, we’re going to rename the default configuration file to the expected name. Although we’re doing this in the shell, we’re in the app volume so all changes here are persistent. Technically, we could do this directly in the app volume on our local OS if that is more convenient - root@b3feb661344f:&#x2F;app# git clone https:&#x2F;&#x2F;github.com&#x2F;ppoffice&#x2F;hexo-theme-hueman.git themes&#x2F;huemanCloning into &#39;themes&#x2F;hueman&#39;...remote: Enumerating objects: 1831, done.remote: Total 1831 (delta 0), reused 0 (delta 0), pack-reused 1831Receiving objects: 100% (1831&#x2F;1831), 5.55 MiB | 1.51 MiB&#x2F;s, done.Resolving deltas: 100% (935&#x2F;935), done.root@b3feb661344f:&#x2F;app#root@b3feb661344f:&#x2F;app# mv themes&#x2F;hueman&#x2F;_config.yml.example themes&#x2F;hueman&#x2F;_config.ymlroot@b3feb661344f:&#x2F;app# exit The next change, is to our blog configuration file which again, is now accessible in two ways In the container under /app/_config.yml Outside of the container in the local directory, in my case this would be /Users/james/Dropbox/James/Application\\ Folders/docker/volumes/masteringansible.com/_config.yml To reiterate, when we created the container, we specified the volume location so these files are accessible both inside the container (via an interactive shell) and outside of the container (via your filesystem). If you wish to make changes inside the container using an editor like vim, you will need to install an editor as the container is built from a lightweight image that has no default editors (i.e. apt update &amp;&amp; apt -y install vim), n.b. this change is to the running container and won’t persist should the container be destroyed/recreated). Change the following context in _config.yml to use hueman as the theme - # Extensions## Plugins: https:&#x2F;&#x2F;hexo.io&#x2F;plugins&#x2F;## Themes: https:&#x2F;&#x2F;hexo.io&#x2F;themes&#x2F;theme: hueman It is also worth setting the language to en, if you’re using English, I noticed that without this, my configuration defaulted to Dutch - # Sitetitle: Hexosubtitle:description:keywords:author: John Doelanguage: entimezone: After making these change, if you’re in the running container, exit and then restart the Docker container - $ docker restart hexo-masteringansible.comhexo-masteringansible.com Wait for the server to start, checking the logs if necessary and then, accessing http://localhost:4001, should now give you the site, with the hueman plugin enabled - Personalising the PageWhere desired you can personalise the page. Pages/Posts can be added using the Admin interface and changes can be made to both _config.yml and themes/hueman/_config.yml for Hexo and the Hueman theme respectively. We’re not going to cover this aspect in detail but should you wish to do so before continuing, now is a good time to try out the platform. For my own site, masteringansible.com, I performed the following changes as a starter guide. Updated _config.yml with the following - # Sitetitle: MasteringAnsible.comsubtitle:description: Official website for the Mastering Ansible online coursekeywords: Mastering Ansibleauthor: James Spurinlanguage: entimezone: Changed the logo in themes/hueman/source/css/images and updated themes/hueman/_config.yml to reflect my social media settings and the new logo size - # Customizecustomize: logo: width: 340 height: 154 url: images&#x2F;logo-header.png theme_color: &#39;#006bde&#39; highlight: androidstudio sidebar: left # sidebar position, options: left, right thumbnail: true # enable posts thumbnail, options: true, false favicon: # path to favicon social_links: # for more icons, please see http:&#x2F;&#x2F;fontawesome.io&#x2F;icons&#x2F;#brand linkedin: https:&#x2F;&#x2F;uk.linkedin.com&#x2F;in&#x2F;jamesspurin facebook: https:&#x2F;&#x2F;www.facebook.com&#x2F;james.spurin github: https:&#x2F;&#x2F;github.com&#x2F;spurin twitter: https:&#x2F;&#x2F;twitter.com&#x2F;jamesspurin medium: https:&#x2F;&#x2F;medium.com&#x2F;@spurin If you review further in the themes/hueman/_config.yml file, there is an entry that relates to insight search. I personally like this feature and it’s installation is pretty straight forward, the configuration makes reference to the following - # Searchsearch: insight: true # you need to install &#96;hexo-generator-json-content&#96; before using Insight Search swiftype: # enter swiftype install key here baidu: false # you need to disable other search engines to use Baidu search, options: true, false For this, we’re going to need some additional npm requirements, fortunately, the image has been built to accomodate this. Execute a shell, and then add the requirement to requirements.txt in the app volume. $ docker exec -it hexo-masteringansible.com bashroot@b3feb661344f:&#x2F;app#$ echo hexo-generator-json-content &gt;&gt; requirements.txt$ exit Restart the container, it should now, at execution, install any requirements as part of the startup process $ docker restart hexo-masteringansible.com &amp;&amp; docker logs --follow hexo-masteringansible.com &lt;snip&gt;***** App directory contains a requirements.txt file, installing npm requirements *****npm WARN optional SKIPPING OPTIONAL DEPENDENCY: fsevents@2.1.2 (node_modules&#x2F;fsevents):npm WARN notsup SKIPPING OPTIONAL DEPENDENCY: Unsupported platform for fsevents@2.1.2: wanted &#123;&quot;os&quot;:&quot;darwin&quot;,&quot;arch&quot;:&quot;any&quot;&#125; (current: &#123;&quot;os&quot;:&quot;linux&quot;,&quot;arch&quot;:&quot;x64&quot;&#125;)npm WARN optional SKIPPING OPTIONAL DEPENDENCY: fsevents@1.2.11 (node_modules&#x2F;nunjucks&#x2F;node_modules&#x2F;fsevents):npm WARN notsup SKIPPING OPTIONAL DEPENDENCY: Unsupported platform for fsevents@1.2.11: wanted &#123;&quot;os&quot;:&quot;darwin&quot;,&quot;arch&quot;:&quot;any&quot;&#125; (current: &#123;&quot;os&quot;:&quot;linux&quot;,&quot;arch&quot;:&quot;x64&quot;&#125;)npm WARN optional SKIPPING OPTIONAL DEPENDENCY: fsevents@1.2.11 (node_modules&#x2F;hexo-admin&#x2F;node_modules&#x2F;fsevents):npm WARN notsup SKIPPING OPTIONAL DEPENDENCY: Unsupported platform for fsevents@1.2.11: wanted &#123;&quot;os&quot;:&quot;darwin&quot;,&quot;arch&quot;:&quot;any&quot;&#125; (current: &#123;&quot;os&quot;:&quot;linux&quot;,&quot;arch&quot;:&quot;x64&quot;&#125;)+ hexo-generator-json-content@4.1.6added 6 packages from 24 contributors, removed 1 package and audited 4834 packages in 88.184s5 packages are looking for funding run &#96;npm fund&#96; for detailsfound 17 vulnerabilities (4 low, 6 moderate, 6 high, 1 critical) run &#96;npm audit fix&#96; to fix them, or &#96;npm audit&#96; for details***** App .ssh directory exists and has content, continuing *****&lt;snip&gt; Using the admin page, I created initial posts, an about post and a purchase page . The page, for me, now looks like the following - Using the SSH Deploy KeyWe’re going to use SSH keys to deploy our site to Github, this is conveniently done as part of the application generation and we can use the SSH key generated, i.e. ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2z5BbOk241XaNTALIlcHDF57WHQTvfA+NV8T7Puw5wk0hZExIWNZt0zfqD8m1XYWUYRlQbCx1wUMGRGOCHq5NtXlzQmCiDkBULXgoofC+&#x2F;8trD0p8pwzCPW8BZ4&#x2F;agRDIExdnaMD2Wqd8VCg&#x2F;1&#x2F;Y09QM3k5roiXPy7ES4ZCp5QHCbBJ1EXWjpgfn50o5pbq64Mgnw05lsAVbFjtSHm6Th+tN0IXbUvXO0znRvDTEJ15cG7uf9pI1rstCzydK0mqYDrOyqWYk&#x2F;aroJpnoJGnbT0AKnVoo3c5IS4w1SSY33Ju6G82QMjFOrPqqQPM3dNBIQHb2crRN+VxKpLAjMojfr root@b3feb661344f n.b. this is an example only and has not been used, outside of this tutorial, you willneed to use your own SSH key. On Github, create a repository called something.github.ioIn my case, I created masteringansible.github.io - Using the Github GUI, I created a simple index.html with the word ‘test’ in it. This will easily allow you to verify that the site is working in its current form, i.e. https://masteringansible.github.io Configuring a domain name using GithubIf you wish to host your site with a custom domain, in the project settings in the github repository, you can enable as follows - After doing this, you’re repository will consist of 2 files, the index.html previously created and a file called CNAME, this file is important and we need to factor this into our hexo configuration later. For now, the repository will look like the following - Adding the Deployment Keys to GithubWhilst in the repository, we can add the deployment keys that we created - In Settings, choose Deploy Keys - Select Add deploy key And paste the key we created earlier If successful, you should see something similar to this - Configuring the Domain ANAMEMost modern domain name sites provide the convenience of an ANAME in the DNS configurator. Should you wish to know more about ANAME’s, see Andre Wallen’s blog entry I’m using name.com for my domain and the entry is as follows. Wait for DNS PropagationDNS can take time to update, when it’s ready, you should be able to see the following using the dig command in Linux/Mac environments - $ dig masteringansible.com; &lt;&lt;&gt;&gt; DiG 9.9.7-P3 &lt;&lt;&gt;&gt; masteringansible.com;; global options: +cmd;; Got answer:;; -&gt;&gt;HEADER&lt;&lt;- opcode: QUERY, status: NOERROR, id: 42137;; flags: qr rd ra; QUERY: 1, ANSWER: 4, AUTHORITY: 0, ADDITIONAL: 1;; OPT PSEUDOSECTION:; EDNS: version: 0, flags:; udp: 512;; QUESTION SECTION:;masteringansible.com. IN A;; ANSWER SECTION:masteringansible.com. 300 IN A 185.199.109.153masteringansible.com. 300 IN A 185.199.111.153masteringansible.com. 300 IN A 185.199.108.153masteringansible.com. 300 IN A 185.199.110.153;; Query time: 19 msec;; SERVER: 194.168.4.100#53(194.168.4.100);; WHEN: Sat Mar 09 18:03:42 GMT 2019;; MSG SIZE rcvd: 113 Or, if you’re on a Windows host, the equivalent via the Google DNS Toolbox If you now browse to your domain with https://domain.com, you should be presented with the word ‘test’, n.b. it can take time for github to generate https certificates so if you encounter an issue here, check settings on your github repository. Configure CNAME in Hexo and Deploy SettingsEarlier on, when we set a custom CNAME in Github, it created a file called CNAME in the repository, we need to ensure that this file is in our source on Hexo, otherwise, this will be removed during deployment, breaking the cname configuration for our site. Create an equivalent file in the source directory - $ docker exec -it hexo-masteringansible.com bashroot@b3feb661344f:&#x2F;app# echo masteringansible.com &gt; source&#x2F;CNAMEexit Edit _config.yml and update the deployment section with your own github settings - # Deployment## Docs: https:&#x2F;&#x2F;hexo.io&#x2F;docs&#x2F;deployment.htmldeploy: type: git repo: git@github.com:spurin&#x2F;masteringansible.github.io.git branch: master message: &quot;Site updated&quot; Generating contentIn preparation for the launch of the site, we can request that Hexo generates the content for us $ docker exec hexo-masteringansible.com hexo generateINFO Start processingINFO Files loaded in 1.87 sINFO Generated: content.jsonINFO Generated: index.htmlINFO Generated: archives&#x2F;index.htmlINFO Generated: archives&#x2F;2019&#x2F;03&#x2F;index.htmlINFO Generated: archives&#x2F;2019&#x2F;index.htmlINFO Generated: purchase&#x2F;index.htmlINFO Generated: categories&#x2F;Purchase&#x2F;index.htmlINFO Generated: about&#x2F;index.htmlINFO Generated: 2019&#x2F;03&#x2F;09&#x2F;Purchase&#x2F;index.htmlINFO Generated: 2019&#x2F;03&#x2F;09&#x2F;About-Mastering-Ansible&#x2F;index.htmlINFO Generated: css&#x2F;images&#x2F;opacity-10.pngINFO Generated: css&#x2F;images&#x2F;logo-header.orig.pngINFO Generated: CNAMEINFO Generated: css&#x2F;images&#x2F;thumb-default-small.pngINFO Generated: css&#x2F;images&#x2F;thumb-default.pngINFO Generated: css&#x2F;images&#x2F;logo-header.pngINFO Generated: css&#x2F;images&#x2F;s-left.pngINFO Generated: libs&#x2F;lightgallery&#x2F;fonts&#x2F;lg.eotINFO Generated: libs&#x2F;source-code-pro&#x2F;fonts&#x2F;mrl8jkM18OlOQN8JLgasD9V_2ngZ8dMf8fLgjYEouxg.woff2INFO Generated: libs&#x2F;lightgallery&#x2F;css&#x2F;lg-fb-comment-box.css.mapINFO Generated: libs&#x2F;source-code-pro&#x2F;fonts&#x2F;mrl8jkM18OlOQN8JLgasDy2Q8seG17bfDXYR_jUsrzg.woff2INFO Generated: libs&#x2F;lightgallery&#x2F;fonts&#x2F;lg.svgINFO Generated: libs&#x2F;lightgallery&#x2F;fonts&#x2F;lg.ttfINFO Generated: libs&#x2F;lightgallery&#x2F;img&#x2F;loading.gifINFO Generated: libs&#x2F;lightgallery&#x2F;img&#x2F;video-play.pngINFO Generated: libs&#x2F;lightgallery&#x2F;css&#x2F;lightgallery.css.mapINFO Generated: libs&#x2F;lightgallery&#x2F;img&#x2F;vimeo-play.pngINFO Generated: libs&#x2F;lightgallery&#x2F;fonts&#x2F;lg.woffINFO Generated: libs&#x2F;lightgallery&#x2F;css&#x2F;lg-transitions.css.mapINFO Generated: libs&#x2F;titillium-web&#x2F;fonts&#x2F;anMUvcNT0H1YN4FII8wpr_SNRT0fZ5CX-AqRkMYgJJo.woff2INFO Generated: libs&#x2F;titillium-web&#x2F;fonts&#x2F;7XUFZ5tgS-tD6QamInJTcSo_WB_cotcEMUw1LsIE8mM.woff2INFO Generated: libs&#x2F;lightgallery&#x2F;img&#x2F;youtube-play.pngINFO Generated: libs&#x2F;titillium-web&#x2F;fonts&#x2F;anMUvcNT0H1YN4FII8wpr46gJz9aNFrmnwBdd69aqzY.woff2INFO Generated: libs&#x2F;titillium-web&#x2F;fonts&#x2F;anMUvcNT0H1YN4FII8wpr9INifKjd1RJ3NxxEi9Cy2w.woff2INFO Generated: libs&#x2F;titillium-web&#x2F;fonts&#x2F;7XUFZ5tgS-tD6QamInJTcZSnX671uNZIV63UdXh3Mg0.woff2INFO Generated: libs&#x2F;titillium-web&#x2F;fonts&#x2F;anMUvcNT0H1YN4FII8wpr4-67659ICLY8bMrYhtePPA.woff2INFO Generated: images&#x2F;pasted-0.pngINFO Generated: js&#x2F;main.jsINFO Generated: libs&#x2F;justified-gallery&#x2F;justifiedGallery.min.cssINFO Generated: libs&#x2F;source-code-pro&#x2F;styles.cssINFO Generated: libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.eotINFO Generated: libs&#x2F;font-awesome&#x2F;fonts&#x2F;FontAwesome.otfINFO Generated: css&#x2F;style.cssINFO Generated: libs&#x2F;titillium-web&#x2F;styles.cssINFO Generated: libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.woff2INFO Generated: libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.woffINFO Generated: libs&#x2F;lightgallery&#x2F;css&#x2F;lg-fb-comment-box.cssINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-hash.min.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-autoplay.min.jsINFO Generated: libs&#x2F;lightgallery&#x2F;css&#x2F;lg-fb-comment-box.min.cssINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-autoplay.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-fullscreen.min.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-pager.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-fullscreen.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-hash.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-share.min.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-share.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-pager.min.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-video.min.jsINFO Generated: js&#x2F;insight.jsINFO Generated: libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.ttfINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-thumbnail.min.jsINFO Generated: libs&#x2F;justified-gallery&#x2F;jquery.justifiedGallery.min.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-video.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-zoom.min.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-thumbnail.jsINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lg-zoom.jsINFO Generated: images&#x2F;pasted-3.pngINFO Generated: images&#x2F;pasted-4.pngINFO Generated: images&#x2F;pasted-2.pngINFO Generated: libs&#x2F;lightgallery&#x2F;css&#x2F;lightgallery.min.cssINFO Generated: libs&#x2F;lightgallery&#x2F;css&#x2F;lightgallery.cssINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lightgallery.min.jsINFO Generated: libs&#x2F;font-awesome&#x2F;css&#x2F;font-awesome.min.cssINFO Generated: libs&#x2F;font-awesome&#x2F;css&#x2F;font-awesome.cssINFO Generated: libs&#x2F;lightgallery&#x2F;css&#x2F;lg-transitions.min.cssINFO Generated: libs&#x2F;lightgallery&#x2F;css&#x2F;lg-transitions.cssINFO Generated: libs&#x2F;lightgallery&#x2F;js&#x2F;lightgallery.jsINFO Generated: libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.svgINFO Generated: libs&#x2F;jquery&#x2F;3.3.1&#x2F;jquery.min.jsINFO Generated: images&#x2F;pasted-1.pngINFO 81 files generated in 3.13 s Finally, Deploy the site$ docker exec -it hexo-masteringansible.com hexo deployINFO Deploying: gitINFO Clearing .deploy_git folder...INFO Copying files from public folder...INFO Copying files from extend dirs...[master (root-commit) 37b974f] Site updated: 2019-03-09 18:26:05 81 files changed, 15456 insertions(+) create mode 100644 2019&#x2F;03&#x2F;09&#x2F;About-Mastering-Ansible&#x2F;index.html create mode 100644 2019&#x2F;03&#x2F;09&#x2F;Purchase&#x2F;index.html create mode 100644 about&#x2F;index.html create mode 100644 archives&#x2F;2019&#x2F;03&#x2F;index.html create mode 100644 archives&#x2F;2019&#x2F;index.html create mode 100644 archives&#x2F;index.html create mode 100644 categories&#x2F;Purchase&#x2F;index.html create mode 100644 content.json create mode 100644 css&#x2F;images&#x2F;logo-header.orig.png create mode 100644 css&#x2F;images&#x2F;logo-header.png create mode 100644 css&#x2F;images&#x2F;opacity-10.png create mode 100644 css&#x2F;images&#x2F;s-left.png create mode 100644 css&#x2F;images&#x2F;thumb-default-small.png create mode 100644 css&#x2F;images&#x2F;thumb-default.png create mode 100644 css&#x2F;style.css create mode 100644 CNAME create mode 100644 images&#x2F;pasted-0.png create mode 100644 images&#x2F;pasted-1.png create mode 100644 images&#x2F;pasted-2.png create mode 100644 images&#x2F;pasted-3.png create mode 100644 images&#x2F;pasted-4.png create mode 100644 index.html create mode 100644 js&#x2F;insight.js create mode 100644 js&#x2F;main.js create mode 100644 libs&#x2F;font-awesome&#x2F;css&#x2F;font-awesome.css create mode 100644 libs&#x2F;font-awesome&#x2F;css&#x2F;font-awesome.min.css create mode 100644 libs&#x2F;font-awesome&#x2F;fonts&#x2F;FontAwesome.otf create mode 100644 libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.eot create mode 100644 libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.svg create mode 100644 libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.ttf create mode 100644 libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.woff create mode 100644 libs&#x2F;font-awesome&#x2F;fonts&#x2F;fontawesome-webfont.woff2 create mode 100644 libs&#x2F;jquery&#x2F;3.3.1&#x2F;jquery.min.js create mode 100644 libs&#x2F;justified-gallery&#x2F;jquery.justifiedGallery.min.js create mode 100644 libs&#x2F;justified-gallery&#x2F;justifiedGallery.min.css create mode 100644 libs&#x2F;lightgallery&#x2F;css&#x2F;lg-fb-comment-box.css create mode 100644 libs&#x2F;lightgallery&#x2F;css&#x2F;lg-fb-comment-box.css.map create mode 100644 libs&#x2F;lightgallery&#x2F;css&#x2F;lg-fb-comment-box.min.css create mode 100644 libs&#x2F;lightgallery&#x2F;css&#x2F;lg-transitions.css create mode 100644 libs&#x2F;lightgallery&#x2F;css&#x2F;lg-transitions.css.map create mode 100644 libs&#x2F;lightgallery&#x2F;css&#x2F;lg-transitions.min.css create mode 100644 libs&#x2F;lightgallery&#x2F;css&#x2F;lightgallery.css create mode 100644 libs&#x2F;lightgallery&#x2F;css&#x2F;lightgallery.css.map create mode 100644 libs&#x2F;lightgallery&#x2F;css&#x2F;lightgallery.min.css create mode 100644 libs&#x2F;lightgallery&#x2F;fonts&#x2F;lg.eot create mode 100644 libs&#x2F;lightgallery&#x2F;fonts&#x2F;lg.svg create mode 100644 libs&#x2F;lightgallery&#x2F;fonts&#x2F;lg.ttf create mode 100644 libs&#x2F;lightgallery&#x2F;fonts&#x2F;lg.woff create mode 100644 libs&#x2F;lightgallery&#x2F;img&#x2F;loading.gif create mode 100644 libs&#x2F;lightgallery&#x2F;img&#x2F;video-play.png create mode 100644 libs&#x2F;lightgallery&#x2F;img&#x2F;vimeo-play.png create mode 100644 libs&#x2F;lightgallery&#x2F;img&#x2F;youtube-play.png create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-autoplay.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-autoplay.min.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-fullscreen.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-fullscreen.min.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-hash.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-hash.min.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-pager.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-pager.min.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-share.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-share.min.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-thumbnail.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-thumbnail.min.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-video.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-video.min.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-zoom.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lg-zoom.min.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lightgallery.js create mode 100644 libs&#x2F;lightgallery&#x2F;js&#x2F;lightgallery.min.js create mode 100644 libs&#x2F;source-code-pro&#x2F;fonts&#x2F;mrl8jkM18OlOQN8JLgasD9V_2ngZ8dMf8fLgjYEouxg.woff2 create mode 100644 libs&#x2F;source-code-pro&#x2F;fonts&#x2F;mrl8jkM18OlOQN8JLgasDy2Q8seG17bfDXYR_jUsrzg.woff2 create mode 100644 libs&#x2F;source-code-pro&#x2F;styles.css create mode 100644 libs&#x2F;titillium-web&#x2F;fonts&#x2F;7XUFZ5tgS-tD6QamInJTcSo_WB_cotcEMUw1LsIE8mM.woff2 create mode 100644 libs&#x2F;titillium-web&#x2F;fonts&#x2F;7XUFZ5tgS-tD6QamInJTcZSnX671uNZIV63UdXh3Mg0.woff2 create mode 100644 libs&#x2F;titillium-web&#x2F;fonts&#x2F;anMUvcNT0H1YN4FII8wpr4-67659ICLY8bMrYhtePPA.woff2 create mode 100644 libs&#x2F;titillium-web&#x2F;fonts&#x2F;anMUvcNT0H1YN4FII8wpr46gJz9aNFrmnwBdd69aqzY.woff2 create mode 100644 libs&#x2F;titillium-web&#x2F;fonts&#x2F;anMUvcNT0H1YN4FII8wpr9INifKjd1RJ3NxxEi9Cy2w.woff2 create mode 100644 libs&#x2F;titillium-web&#x2F;fonts&#x2F;anMUvcNT0H1YN4FII8wpr_SNRT0fZ5CX-AqRkMYgJJo.woff2 create mode 100644 libs&#x2F;titillium-web&#x2F;styles.css create mode 100644 purchase&#x2F;index.htmlThe authenticity of host &#39;github.com (192.30.253.113)&#39; can&#39;t be established.RSA key fingerprint is SHA256:nThbg6kXUpJWGl7E1IGOCspRomTxdCARLviKw6E5SY8.Are you sure you want to continue connecting (yes&#x2F;no)? yesWarning: Permanently added &#39;github.com,192.30.253.113&#39; (RSA) to the list of known hosts.Counting objects: 114, done.Delta compression using up to 2 threads.Compressing objects: 100% (103&#x2F;103), done.Writing objects: 100% (114&#x2F;114), 2.00 MiB | 869.00 KiB&#x2F;s, done.Total 114 (delta 11), reused 0 (delta 0)remote: Resolving deltas: 100% (11&#x2F;11), done.To github.com:spurin&#x2F;masteringansible.github.io.git + d3fe1f1...37b974f HEAD -&gt; master (forced update)Branch master set up to track remote branch master from git@github.com:spurin&#x2F;masteringansible.github.io.git.INFO Deploy done: git At this point, you should be able to successfully navigate to your site with https://domain.com and if so, give yourself a pat on the back :-) Future ChangesFrom this point forward, you can quite simply use the local Hexo-Admin interface for updates, and when ready, push changes to your live site with a one liner as follows - $ docker exec hexo-masteringansible.com bash -c &#39;hexo generate &amp;&amp; hexo deploy&#39; Saving your current image, and future imagesWhilst the docker containers in use here, should be able to be created and recreated as needed alongside the persistent application data, there is a risk that a future version of Hexo, may indeed break the execution process (after all Hexo and the supporting libraries are constantly evolving). If you have a working container image, I recommend, taking a point in time copy, allowing you if required, to load that precise image at a future date. All of the changes that you’ve made to the Docker image that involved command execution outside of /app, would have resulted in additional layers to that of the original spurin/hexo(-domain.com) images that you’ve been working on. Whilst our /app data is safe inside it’s own volume, we may wish to save the current state of our running image. Commit the current container state as am image, using YYYYMMDD as the reference - $ docker commit hexo-masteringansible.com spurin&#x2F;hexo-masteringansible.com:20200103sha256:4ee249ff19ba1d7e6edcef83705543a458fb1a52ffa7219fc5f2d6b038e6cb1f And save the new image to a file - $ docker save spurin&#x2F;hexo-masteringansible.com:20200103 &gt; spurin_hexo-masteringansible.com_20200103.tar In a worst case scenario, you can now load this image, and recreate your container to get it back to a known point in time. Closing remarksThis post, summarises different technologies with a desired outcome of a working site/blog. Hopefully by the end of it, you’ve got a working site and/or have learnt something new. Comments and feedback are very welcome. Thanks - James Spurin","categories":[],"tags":[{"name":"Blogging","slug":"Blogging","permalink":"http://spurin.com/tags/Blogging/"},{"name":"Hexo","slug":"Hexo","permalink":"http://spurin.com/tags/Hexo/"},{"name":"Docker","slug":"Docker","permalink":"http://spurin.com/tags/Docker/"},{"name":"Github","slug":"Github","permalink":"http://spurin.com/tags/Github/"},{"name":"Blog","slug":"Blog","permalink":"http://spurin.com/tags/Blog/"},{"name":"Hosting","slug":"Hosting","permalink":"http://spurin.com/tags/Hosting/"},{"name":"HTTPS","slug":"HTTPS","permalink":"http://spurin.com/tags/HTTPS/"},{"name":"Website","slug":"Website","permalink":"http://spurin.com/tags/Website/"}],"author":"James Spurin"},{"title":"Ansible London Meetup 19th March 2019","slug":"Ansible-London-Meetup-19th-March-2019","date":"2019-03-20T17:40:00.000Z","updated":"2019-03-23T12:58:54.000Z","comments":true,"path":"2019/03/20/Ansible-London-Meetup-19th-March-2019/","link":"","permalink":"http://spurin.com/2019/03/20/Ansible-London-Meetup-19th-March-2019/","excerpt":"","text":"The Ansible London Meet-up on the 19th March 2019, at the Sainsbury’s headquarters was a fantastic event with great speakers, covering aspects ranging from variable precedence, using the upstream AWX in a corporate environment and automating your Mac(book) with Ansible. My full summary is available at masteringansible.com","categories":[],"tags":[],"author":"James Spurin"},{"title":"Diagnosed with HSP, Hereditary Spastic Paraparesis, What to do next","slug":"Diagnosed-with-HSP-Hereditary-Spastic-Paraparesis-What-to-do-next","date":"2019-03-16T19:00:00.000Z","updated":"2019-03-17T01:18:40.000Z","comments":true,"path":"2019/03/16/Diagnosed-with-HSP-Hereditary-Spastic-Paraparesis-What-to-do-next/","link":"","permalink":"http://spurin.com/2019/03/16/Diagnosed-with-HSP-Hereditary-Spastic-Paraparesis-What-to-do-next/","excerpt":"","text":"I remember clearly, the events that led up to the diagnosis of being disabled with HSP, Hereditary Spastic Paraparesis/Paraplegia a type of Motor Neurone Disease and how it came as a complete shock. There were many aspects to my diagnosis and eventual acceptance of HSP. Throughout my journey there were areas that were great and … not so great. I’ve written this, as a guide to anyone who is as unfortunate as myself to receive such a diagnosis, and how they can do the very best in achieving the best care and most importantly, the most accurate diagnosis in the shortest amount of time. BackstoryI’d been working in America, at the time in New Jersey/New York, and with friends, had been enjoying the delights and all the city had to offer, it was an extremely fun time! One too many drinks and I had stumbled on an escalator in New Jersey and managed to catch my foot on a jagged edge. Unlike the escalators in the UK that have a smooth curve, this was an edge that intertwined amongst the top and bottom step, looking something like this - My ankle got caught and I ended up with 3 clear incision marks. At the time I didn’t feel like I really needed hospital and just looked after it myself. After returning back to the UK, I found that my right foot, was catching on the ground. I went to my local GP and expected them to refer me to another hospital where I would receive treatment for the damage to my ankle. GP AppointmentNew to the area, I met with a fantastic GP who was in herself very direct and very scientific, she didn’t really have the sympathetic approach that many would hope for from a GP but for me and the profession I work in, I was grateful of the logic that she applied with her diagnosis. It was during this session that I first heard of the ‘clonus test’ … Clonus testClonus, is a sign of spasticity, i.e. tightness in the legs and can be an indicator of an issue relating to upper motor neurone disfunction. The clonus test is a simple test that is a common procedure for those with types of Motor Neurone Disease or other conditions like Cerebral Palsy where spasticity is a common trait. Quite simply, you lie down, relax your foot with the knee slightly bent, then the individual testing takes your foot and pushes it up quickly towards your chest. What follows, is a series of beats which to you and I, are your foot shaking uncontrollably. With this condition, as much as you try, it is impossible to stop the beats. I would experience around 4-5 beats at first but over time this progressed to 6-8. I’ve spoken to individuals with the condition who go as long as minutes, when they have such a test. GP Appointment continuedThe GP, during her examination performed the clonus test and subsequently, she noticed something that led her to an indicator that needed the expertise of a neurologist more so than that of a GP. With zero knowledge in the neurological field, I went along with this and accepted her advice for a referral to Queens Square, in London. Queens Square I arrived at Queens Square for days of diagnosis and testing and on heading to the hospital, I was completely unaware of what I was letting myself in for. As I entered the hospital and walked the corridors, I felt a strange sense of Deja Vu and it was when I saw a portrait of Princess Diana that a memory flashed back to me, I had been here before. When I first came to London, back in 1999 I had interviewed for a number of jobs and had interviewed at Queens Square, in the IT department, hidden away in the rafters of the building. I interviewed at many places during this window with a desperation to move to London so it wasn’t much of a surprise that I didn’t really remember it. Meeting the RegistrarMy first interaction was with a registrar whom looking back on this journey, made the worst clinical mistake of my entire diagnostic journey.He performed a variety of physiological tests and then, in front of me, with no attempt to hide the screen, proceeded to look through Wikipedia, with no rhyme or rhythm at various different neurological diseases before settling on HSP. Given that at the time, I had spent years studying for a Masters in Software Engineering, and knew academically how much Wikipedia was frowned upon as a source of reference (even though, I love Wikipedia and regularly donate), I was quite shocked, to see this individual diagnosing me with a serious disease via Wikipedia. This, brought in itself a catalyst of disagreement regarding my diagnosis. In my opinion this was a significant failing of my diagnosis period at Queens Square, owing to the doubt that it provided from that point onwards. Fully Body MRI I received a full body MRI, covering both the brain and body and in praise to Queens Square, they managed to both perform the MRI and the analysis very quickly, turning the results around during my time and visit at the hospital. The spinal region was checked for pathologies that could relate to the symptoms experienced, for example a condition known as Spinal Stenosis can result in what appears to be spasticity. The brain MRI is scanned for abnormalities and thickening of specific areas that are again markers, for neurological diseases like HSP. In my case, the MRI came back successful. Genetics Test The genetic test was performed and during my visit I received the results. At the time I trusted in this genetics test and was very relieved to again hear that this came back with no positive match. With little knowledge of this area, I naturally saw this as a huge win. Naively I thought, if the genetics didn’t match, I was okay. EMG Test Next came the EMG nerve conduction test, the electromyography test where various electrodes were placed on my body, and my muscles were stimulated. EMG stands for - Electro: The electrical impulses that are being measured Myo: Muscle Graphy: The way the results of the test are presented The results were again, extremely positive, there was no indication of there being any issues. 1 + 1 + 1 = 5Time for the results and going into this, I was admittedly smug … I had received an almost perfect outcome from all of the tests and apart from the Wikipedia incident, it was looking good. Regardless, I received the harsh news that I have a diagnosis of Hereditary Spastic Paraparesis. I didn’t believe the outcome and thought of it as complete and utter nonsense, driven on by an initial Wikipedia led opinion by someone who felt to me, like they were in-experienced in the position they held. I didn’t believe this outcome and came back from it thinking that the whole process was a farce. I posted on Facebook, that I’d been for tests and everything came back as okay… People celebrated my news with me. My wife, was somewhat annoyed… she knew deep down I was being over optimistic and had gradually seen my decline. Time Progressed, Disability ProgressedOver time, my condition continued to deteriorate and soon there was no denying that something wasn’t quite right, throughout all of this, my ignorance and fight not to be disabled was prevalent. The disease took control of me more and more and my gait deteriorated. I went from being asked if I had a problem with my foot, to being asked if I had a limp to what is your disability … It was time to get organised… Getting Organised So much had gone on between the GP and Queens Square, and the various departments that I was, completely lost. I requested access to all of my notes and all of the test data that had taken place. Both hospitals and GP’s, have a requirement to provide their patients with copies of data in all available formats should it be requested. This includes paper correspondence, electronic correspondence between staff, and the actual data for the likes of MRI’s and X-Rays. It does come at a cost and to estimate, I believe I spent approximately £200, requesting all of the data. This gave me the entirety of all of my notes, right the way back to being a young child living in Wales. You get stacks of photocopied data, sent in parcels as a result. With my scanner working overtime, I categorised notes as follows, each of them were given a starting date in the format ‘YYYYMMDD - Subject’, the beauty of this naming convention is that you can sort the folder by name and they are naturally sorted by date. I also split them into two folders, Diagnostic Information and Non Diagnostic Information. When you go through your notes, you’ll have so much data and a lot of it is irrelevant but potentially worth keeping, this is where the isolation between diagnostic and non diagnostic helps. For data provided on a CD, such as X-Ray’s and MRI’s, I captured these as images on my computer, so that I could share them should they be needed. Researching the ContextWith the data organised you can now work through the notes. Whilst you may not be a neurologist, with the sheer amount of information available on the Internet, it doesn’t take much to get, albeit, a basic understanding of what the staff are discussing and context surrounding it. Moving forward with the ContextIt was time to see Queens Square again and on going back, I was fortunate to have the support of a fantastic team, Professor Nicholas Wood and his colleagues, Professor Henry Houlden and Professor Richard Festenstein. These guys are the gems of Queens Square when it comes to HSP and similar neurological diseases and are in the category of the best Neurologists in the world. Had I been seen and diagnosed by them initially, I’m sure I would have had a lot more confidence with the diagnostic vs it being made via Wikipedia. I was for many years, the annoying patient who kept going back questioning their diagnosis and in fairness, although it must have in some sense, arrogant of me questioning their years of expertise (being world renowned in their respective fields), they allowed me to repeat this although in retrospect it must have been frustrating for them (I’ve apologised in person). I learned, during my own study that the diagnosis of HSP should be made, by excluding all other potential possibilities. I felt that this hadn’t been done 100%, even though now, I understand why they were confident in their diagnosis, so I pushed this to the extreme. What happened next was the following and should you be in my situation, I encourage you to make sure that you tick as many differential diagnosis options, as possible - Exploration #1 - L’Dopa Responsive DystoniaProfessor Wood suggested this based on my feedback that my symptoms, sometimes worsen based on my mood. There is a condition, known as L’Dopa Responsive Dystonia which, presents with very similar markers as that found with Hereditary Spastic Paraparesis. Essentially, there is not enough Dopamine in the body. The good thing though, Dopamine albeit, in a non natural form can be provided to the body via medicine and the test, is quite simply taking medicine for a period of time, providing artificial dopamine. Should you be one of the lucky ones, to have L’Dopa Responsive Dystonia instead of HSP, you’ve hit the jackpot and with regular medicine, you can live a very happy life for the rest of your days. It’s got to be worth a look! Exploration #2 - Genetic TestingHad a genetic result have been found, I would have been a lot more accepting of the diagnosis. I now accept, that HSP may often be made as what is known as a clinical diagnosis, i.e. a diagnosis made by a respectable neurologist, based on the symptoms and signs. Still, a known genetic marker would be conclusive leaving no doubt whatsoever. In my case, I found that I had been tested for 2 genes only during my initial evaluation at Queens Square and frustratingly, I found a page on the Queens Square website emphasising the brilliance of their HSP panel test, which tested for 16+ Genes associated with HSP. I took this to the attention of Queens Square and was tested using their more advanced panel test. Unfortunately, this turned out to be negative as well. Outside of Queens Square, the Neurological University hospital equivalent in Tubingen - Germany, had a HSP Panel test that tested for over 100 genes associated with HSP. I reached out to them and took this test and again, this came back as negative. Whilst the results weren’t great for me, it’s important that you understand that these genetics tests, can vary. Try to find out more about what you’re being tested for and keep track of the genes and tests that are available. If you’re not successful today, it’s not to say you won’t be successful tomorrow. Exploration #3 - Very long fatty chainsThis is a test that can be performed and again, it has the potential for being an indicator of HSP and other similar diseases, again, for me this came back as a negative. Exploration #4 - Vitamin B Deficiency Quite a simple test but one that is worthwhile, Vitamin B Deficiency, in more extreme cases can cause symptoms that are similar to that of HSP. Another negative unfortunately. OutcomeIt took a long time to get to this point, especially with the research and the time it took between appointments (up to a year), seeing the team at Queens Square. As my condition deteriorated, I couldn’t really argue with the team at Queens Square and their diagnosis. I accepted my fate as it was. I was in the realm of managing the condition which is unfortunately, the only outcome with this and many other neurological diseases. Learning this, gave me a newfound respect for a lot of the staff at Queens Square as they generally work in a profession that is surrounded by bad news and individuals who’s conditions are often significantly worse that that of my own, those diagnosed with ALS, the condition Stephen Hawkings was well known for, being a prime example. Light at the end of the tunnel I never gave up on a good outcome throughout my journey and hoped for a way and means out of this nightmare. It’s extremely hard receiving a diagnosis where there is no cure, but, as per advancements in other areas, there are some exciting areas of progression taking place both in the neurological world and elsewhere. For those looking for hope, investigate and keep an eye on crispr, a process which in the future, may allow genetic DNA to be modified, essentially replacing the faulty genes that cause HSP and other diseases. Whilst crispr will take some time in becoming a solution for HSP, there is another option that I am a fan of that is called SDR… (SDR) Selective Dorsal Rhizotomy I first heard about SDR whilst following a free group on Facebook that provides Research into Motor Neurone Diseases. The post, was about a young man in Ireland known as Dylan, who had received the treatment for Cerebral Palsy and how the treatment was also available for HSP. This was exciting news and upon learning about it, I was fortunate through Social Media, to find some amazing adults who had received the treatment, and were doing remarkably well. One of which, ran a free group supporting adults with the treatment. Whilst there were many individuals with CP who had received it, the pool of equivalent HSP patients was scarce. I was lucky to find a person who is now, a very good friend who as an adult, was undergoing the surgery. I followed his whole journey and was amazed at the progress. His cousin, who also suffered from HSP had the surgery shortly after and also experienced results, that he was happy with. Given the outcome, and my own research, I felt comfortable in the opportunity vs risk and proceeded to visit St Louis in America, where I received the treatment as the 22nd person in the world to receive this for HSP. I will be writing more about this journey as a separate post as this context, doesn’t do justice to what is a fabulous option, for those with the pure form of HSP. Watch out for Snake Oil When you’re in such a situation like my own, it’s remarkable, the amount of Snake Oil that you will encounter especially on the Internet. Typically offering quick fixes in exchange for your hard cash. Gene Therapy mostly in India, is a classic and whilst advancement may be made in this area, I suggest that you treat any options with suspicion until you’ve fully done your own homework. I researched SDR, for a significant amount of time before I made the decision to progress with it. I also discussed it with the expertise at Queens Square, before fully progressing. Do your research and don’t be afraid to chat with your neurologist, even if it’s an option external to your main point of care. FinallyWhilst I’ve highlighted some areas of criticism for Queens Square, I’ve also emphasised how great they are and I hope, any such context is seen constructively should it reach their attention. I’m extremely grateful to both the NHS and Queens Square, for their support.","categories":[],"tags":[{"name":"Disability","slug":"Disability","permalink":"http://spurin.com/tags/Disability/"},{"name":"HSP","slug":"HSP","permalink":"http://spurin.com/tags/HSP/"},{"name":"SDR","slug":"SDR","permalink":"http://spurin.com/tags/SDR/"}],"author":"James Spurin"},{"title":"Python Virtual Environments Masterclass","slug":"Python-Virtual-Environments","date":"2019-03-12T19:00:00.000Z","updated":"2019-03-12T19:13:30.000Z","comments":true,"path":"2019/03/12/Python-Virtual-Environments/","link":"","permalink":"http://spurin.com/2019/03/12/Python-Virtual-Environments/","excerpt":"","text":"TL;DRThis tutorial gives a rapid primer of Python Virtual Environments and how to use them in your effectively in your Python programming endeavours. By the end you’ll know how to use Virtual Environments in Python 3 and 2, how to install modules, freezing and replaying environments, whether or not to activate an environment, how to package environments for reuse, how to create wheels of installed modules and how you can make use of the awesome pip-tools module for effective management. Finally, I provide some context on other ways of managing virtual environments, outside of the python core pip package. IntroductionWhen working on Python, or teaching Python to others, an area that I am an advocate for is the use of Virtual Environments for projects. Whilst many online training resources skip or leave such context until later on, personally, I feel that it is an area that is best covered at the earliest opportunity. From a simplistic viewpoint, it provides a convenient environment for individuals to experiment with the plethora of modules available in the python ecosystem, and, mitigates the need for root privileges when installing modules on Linux based systems. There are also a variety of other benefits that this post will aim to cover. Creating Virtual EnvironmentsIn Both Python 2 and Python 3, virtual environments are available, however the creation of which varies between the two major languages and in version 3, there is both a preferred and legacy method. Given the future of Python 3 this post emphasises more on this version of Python, however, much of which in the post will apply to both versions. Creating A Virtual Environment in Python 3 (Preferred Approach)$ python3 -mvenv python3venv Breaking this down, the -m option on the command line, tells the interpreter to run the venv module that is provided as part of the core Python3 distribution. The second parameter of ‘python3venv’ is the name of the virtual environment. The execution of this command should give you a virtual environment in the directory of python3venv. If you’re inquisitive, you can understand more on what is happening behind the scenes by reviewing the actual venv module. A convenient way of identifying the source location, is through the REPL shell - $ python3Python 3.6.4 (v3.6.4:d48ecebad5, Dec 18 2017, 21:07:28)[GCC 4.2.1 (Apple Inc. build 5666) (dot 3)] on darwinType &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more information.&gt;&gt;&gt; import venv&gt;&gt;&gt; print(venv)&lt;module &#39;venv&#39; from &#39;&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;3.6&#x2F;lib&#x2F;python3.6&#x2F;venv&#x2F;__init__.py&#39;&gt; With the code here being at ‘/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/venv/_init_.py’ If you jump to the bottom of the code in question, it has an execution block at the footer of the file allowing it to be executed as a script - if __name__ &#x3D;&#x3D; &#39;__main__&#39;: rc &#x3D; 1 try: main() rc &#x3D; 0 except Exception as e: print(&#39;Error: %s&#39; % e, file&#x3D;sys.stderr) sys.exit(rc) Thus, executing the code directly, executes the main function that provides a list of available arguments to the user - $ python3 -mvenvusage: venv [-h] [--system-site-packages] [--symlinks | --copies] [--clear] [--upgrade] [--without-pip] [--prompt PROMPT] ENV_DIR [ENV_DIR ...]venv: error: the following arguments are required: ENV_DIR Creating A Virtual Environment in Python 3.6 and Below (Deprecated Approach)Python Version 3.6 and below, have an executable called pyvenv which is essentially a binary wrapper for the venv module. If you execute the binary as it is, you can see similarities in the usage syntax, with, an added deprecation warning in certain versions - $ pyvenvWARNING: the pyenv script is deprecated in favour of &#96;python3.6 -m venv&#96;usage: venv [-h] [--system-site-packages] [--symlinks | --copies] [--clear] [--upgrade] [--without-pip] [--prompt PROMPT] ENV_DIR [ENV_DIR ...]venv: error: the following arguments are required: ENV_DIR Running the executable through the strings command, shows a similar entry point with an implicit import of the venv module - $ strings &#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;3.6&#x2F;bin&#x2F;pyvenv#!&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;3.6&#x2F;bin&#x2F;python3.6if __name__ &#x3D;&#x3D; &#39;__main__&#39;: import sys import pathlib executable &#x3D; pathlib.Path(sys.executable or &#39;python3&#39;).name print(&#39;WARNING: the pyenv script is deprecated in favour of &#39; f&#39;&#96;&#123;executable&#125; -m venv&#96;&#39;, file&#x3D;sys.stderr) rc &#x3D; 1 try: import venv venv.main() rc &#x3D; 0 except Exception as e: print(&#39;Error: %s&#39; % e, file&#x3D;sys.stderr) sys.exit(rc) Finally, executing the binary gives the same result as the preferred approach, with the added warning shown in the snippet - $ pyvenv python3venvWARNING: the pyenv script is deprecated in favour of &#96;python3.6 -m venv&#96; Creating A Virtual Environment in Python 2.xOn Python 2.x, the virtualenv binary can be used to create the Virtual Environment, on my Mac, this is available as part of the Python 2.7 installation. In other operating systems your milage may vary and subsequently, virtualenv may need to be installed if it’s not already available. Check for a virtualenv binary - $ which virtualenv&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;2.7&#x2F;bin&#x2F;virtualenv Create a Python 2.x virtualenv. The syntax is similar to Python 3 with the target virtualenv directory. The Python 2 equivalent however gives a lot more in terms of output - $ virtualenv python2venvNew python executable in /Users/james/python2venv/bin/pythonInstalling setuptools, pip, wheel...done. Inspecting the Virtual EnvironmentsIn both cases, a similar structure is created - $ ls python3venv python2venv/python2venv/:bin include libpython3venv:bin include lib pyvenv.cfg The main difference being the pyvenv.cfg file that is visible in the root of the directory. If you’re interested in knowing more about this file PEP-0405 has a lot of context. Activating the Virtual EnvironmentA convenient way of using the virtual environment is through activation, however, it is not an implicit requirement (something we’ll look into further). When you activate the virtual environment, the user’s shell prompt (PS1) is updated and subsequently, the command path gives higher priority to the virtual environment. If we check the PATH before activation, it may look something like this - $ echo $PATH&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;3.6&#x2F;bin:&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;2.7&#x2F;bin:&#x2F;usr&#x2F;local&#x2F;bin:&#x2F;usr&#x2F;bin:&#x2F;bin:&#x2F;usr&#x2F;sbin:&#x2F;sbin Activate the Virtual Environment, n.b. the change to the prompt $ source python3venv&#x2F;bin&#x2F;activate(python3venv) $ And checking the PATH, my virtual environment now takes precedence with it being the first entry in the PATH - (python3venv) $ echo $PATH&#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;bin:&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;3.6&#x2F;bin:&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;2.7&#x2F;bin:&#x2F;usr&#x2F;local&#x2F;bin:&#x2F;usr&#x2F;bin:&#x2F;bin:&#x2F;usr&#x2F;sbin:&#x2F;sbin Python and pip usage in the venvIf we now execute either python or pip, owing to the PATH precedence, the binary from the virtual environment take priority (python3venv) $ which python&#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;bin&#x2F;python(python3venv) $ which pip&#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;bin&#x2F;pip The Python environment, is automatically configured to search the environments paths for module initialisation, we can verify this with the REPL environment, note the addition of /Users/james/python3venv/lib/python3.6/site-packages to the sys.path list - (python3venv) $ pythonPython 3.6.4 (v3.6.4:d48ecebad5, Dec 18 2017, 21:07:28)[GCC 4.2.1 (Apple Inc. build 5666) (dot 3)] on darwinType &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more information.&gt;&gt;&gt; import sys&gt;&gt;&gt; print(sys.path)[&#39;&#39;, &#39;&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;3.6&#x2F;lib&#x2F;python36.zip&#39;, &#39;&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;3.6&#x2F;lib&#x2F;python3.6&#39;, &#39;&#x2F;Library&#x2F;Frameworks&#x2F;Python.framework&#x2F;Versions&#x2F;3.6&#x2F;lib&#x2F;python3.6&#x2F;lib-dynload&#39;, &#39;&#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#39;] Installing packages through pipWith the virtual environment activated, the use of pip will result in requested packages being installed direct to the virtual environment. For example, if we install the awesome datetime module called arrow - (python3venv) $ pip install arrowCollecting arrow Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;f4&#x2F;7f&#x2F;0360628ba40bb93c10cd89cd289b6a8e9ea87b2db884b8edf32c80ee1c73&#x2F;arrow-0.13.1-py2.py3-none-any.whlCollecting python-dateutil (from arrow) Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;41&#x2F;17&#x2F;c62faccbfbd163c7f57f3844689e3a78bae1f403648a6afb1d0866d87fbb&#x2F;python_dateutil-2.8.0-py2.py3-none-any.whl (226kB) 100% |████████████████████████████████| 235kB 3.6MB&#x2F;sCollecting six&gt;&#x3D;1.5 (from python-dateutil-&gt;arrow) Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;73&#x2F;fb&#x2F;00a976f728d0d1fecfe898238ce23f502a721c0ac0ecfedb80e0d88c64e9&#x2F;six-1.12.0-py2.py3-none-any.whlInstalling collected packages: six, python-dateutil, arrowSuccessfully installed arrow-0.13.1 python-dateutil-2.8.0 six-1.12.0You are using pip version 9.0.1, however version 19.0.3 is available.You should consider upgrading via the &#39;pip install --upgrade pip&#39; command. It has installed both arrow, and a dependent module of six and python-dateutil. We can again confirm, that it is actually installed in the virtual environment, through the REPL interface - (python3venv) $ pythonPython 3.6.4 (v3.6.4:d48ecebad5, Dec 18 2017, 21:07:28)[GCC 4.2.1 (Apple Inc. build 5666) (dot 3)] on darwinType &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more information.&gt;&gt;&gt; import arrow&gt;&gt;&gt; print(arrow)&lt;module &#39;arrow&#39; from &#39;&#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;arrow&#x2F;__init__.py&#39;&gt;&gt;&gt;&gt; ^D Using pip to upgrade pipThe eagle eyed amongst you, may have noticed the warning that pip provided above, where a new version is available. In the virtual environment, I typically recommend that people upgrade pip as a post action to creating the venv, prior to installing any modules but showed the approach above as an example of the warning that you may see. We can upgrade the environment as follows - (python3venv) $ pip install --upgrade pipCache entry deserialization failed, entry ignoredCollecting pip Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;d8&#x2F;f3&#x2F;413bab4ff08e1fc4828dfc59996d721917df8e8583ea85385d51125dceff&#x2F;pip-19.0.3-py2.py3-none-any.whlInstalling collected packages: pip Found existing installation: pip 9.0.1 Uninstalling pip-9.0.1: Successfully uninstalled pip-9.0.1Successfully installed pip-19.0.3(python3venv) $ pip --versionpip 19.0.3 from &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;pip (python 3.6) Freezing Virtual EnvironmentsIf we install additional modules to make this example more effective, i.e. flask (python3venv) $ pip install flaskCollecting flask Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;7f&#x2F;e7&#x2F;08578774ed4536d3242b14dacb4696386634607af824ea997202cd0edb4b&#x2F;Flask-1.0.2-py2.py3-none-any.whl (91kB) 100% |████████████████████████████████| 92kB 2.4MB&#x2F;sCollecting Jinja2&gt;&#x3D;2.10 (from flask) Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;7f&#x2F;ff&#x2F;ae64bacdfc95f27a016a7bed8e8686763ba4d277a78ca76f32659220a731&#x2F;Jinja2-2.10-py2.py3-none-any.whl (126kB) 100% |████████████████████████████████| 133kB 7.6MB&#x2F;sCollecting Werkzeug&gt;&#x3D;0.14 (from flask) Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;20&#x2F;c4&#x2F;12e3e56473e52375aa29c4764e70d1b8f3efa6682bef8d0aae04fe335243&#x2F;Werkzeug-0.14.1-py2.py3-none-any.whl (322kB) 100% |████████████████████████████████| 327kB 13.0MB&#x2F;sCollecting itsdangerous&gt;&#x3D;0.24 (from flask) Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;76&#x2F;ae&#x2F;44b03b253d6fade317f32c24d100b3b35c2239807046a4c953c7b89fa49e&#x2F;itsdangerous-1.1.0-py2.py3-none-any.whlCollecting click&gt;&#x3D;5.1 (from flask) Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;fa&#x2F;37&#x2F;45185cb5abbc30d7257104c434fe0b07e5a195a6847506c074527aa599ec&#x2F;Click-7.0-py2.py3-none-any.whl (81kB) 100% |████████████████████████████████| 81kB 15.2MB&#x2F;sCollecting MarkupSafe&gt;&#x3D;0.23 (from Jinja2&gt;&#x3D;2.10-&gt;flask) Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;f0&#x2F;00&#x2F;a6aea33f5598b080b86d6b6d1214b51afe3ffa6100b902d5aa465080083f&#x2F;MarkupSafe-1.1.1-cp36-cp36m-macosx_10_6_intel.whlInstalling collected packages: MarkupSafe, Jinja2, Werkzeug, itsdangerous, click, flaskSuccessfully installed Jinja2-2.10 MarkupSafe-1.1.1 Werkzeug-0.14.1 click-7.0 flask-1.0.2 itsdangerous-1.1.0 We have a significant number of modules, post Flask/Arrow installation. The convenient command of pip freeze, allows us to capture a snapshot of the virtual environment, in this example I’m using tee, to also send the output to a text file called requirements.txt (python3venv) $ pip freeze | tee &#x2F;tmp&#x2F;requirements.txtarrow&#x3D;&#x3D;0.13.1Click&#x3D;&#x3D;7.0Flask&#x3D;&#x3D;1.0.2itsdangerous&#x3D;&#x3D;1.1.0Jinja2&#x3D;&#x3D;2.10MarkupSafe&#x3D;&#x3D;1.1.1python-dateutil&#x3D;&#x3D;2.8.0six&#x3D;&#x3D;1.12.0Werkzeug&#x3D;&#x3D;0.14.1 Replaying a Virtual Environments RequirementsEarlier on, I created a Python 2 virtual environment, let’s use this, to replay the virtual environment configuration. Firstly, we deactivate the existing venv (python3venv) $ deactivate$ Then we activate the Python 2 virtual environment - $ source python2venv&#x2F;bin&#x2F;activate(python2venv) $ Upgrade pip, in most cases you should be able to use ‘pip install –upgrade pip’, however, I encountered an issue and had to perform the following workaround - $ (python2venv) curl https:&#x2F;&#x2F;bootstrap.pypa.io&#x2F;get-pip.py | python % Total % Received % Xferd Average Speed Time Time Time Current Dload Upload Total Spent Left Speed100 1659k 100 1659k 0 0 2375k 0 --:--:-- --:--:-- --:--:-- 2377kDEPRECATION: Python 2.7 will reach the end of its life on January 1st, 2020. Please upgrade your Python as Python 2.7 won&#39;t be maintained after that date. A future version of pip will drop support for Python 2.7.Collecting pip Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;d8&#x2F;f3&#x2F;413bab4ff08e1fc4828dfc59996d721917df8e8583ea85385d51125dceff&#x2F;pip-19.0.3-py2.py3-none-any.whlInstalling collected packages: pip Found existing installation: pip 9.0.1 Uninstalling pip-9.0.1: Successfully uninstalled pip-9.0.1Successfully installed pip-19.0.3 We can now replay the environment in our Python 3 setup, in the Python 2 environment, using the requirements.txt captured using pip freeze - $ (python2venv) pip install -r &#x2F;tmp&#x2F;requirements.txtDEPRECATION: Python 2.7 will reach the end of its life on January 1st, 2020. Please upgrade your Python as Python 2.7 won&#39;t be maintained after that date. A future version of pip will drop support for Python 2.7.Collecting arrow&#x3D;&#x3D;0.13.1 (from -r &#x2F;tmp&#x2F;requirements.txt (line 1)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;f4&#x2F;7f&#x2F;0360628ba40bb93c10cd89cd289b6a8e9ea87b2db884b8edf32c80ee1c73&#x2F;arrow-0.13.1-py2.py3-none-any.whlCollecting Click&#x3D;&#x3D;7.0 (from -r &#x2F;tmp&#x2F;requirements.txt (line 2)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;fa&#x2F;37&#x2F;45185cb5abbc30d7257104c434fe0b07e5a195a6847506c074527aa599ec&#x2F;Click-7.0-py2.py3-none-any.whlCollecting Flask&#x3D;&#x3D;1.0.2 (from -r &#x2F;tmp&#x2F;requirements.txt (line 3)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;7f&#x2F;e7&#x2F;08578774ed4536d3242b14dacb4696386634607af824ea997202cd0edb4b&#x2F;Flask-1.0.2-py2.py3-none-any.whlCollecting itsdangerous&#x3D;&#x3D;1.1.0 (from -r &#x2F;tmp&#x2F;requirements.txt (line 4)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;76&#x2F;ae&#x2F;44b03b253d6fade317f32c24d100b3b35c2239807046a4c953c7b89fa49e&#x2F;itsdangerous-1.1.0-py2.py3-none-any.whlCollecting Jinja2&#x3D;&#x3D;2.10 (from -r &#x2F;tmp&#x2F;requirements.txt (line 5)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;7f&#x2F;ff&#x2F;ae64bacdfc95f27a016a7bed8e8686763ba4d277a78ca76f32659220a731&#x2F;Jinja2-2.10-py2.py3-none-any.whlCollecting MarkupSafe&#x3D;&#x3D;1.1.1 (from -r &#x2F;tmp&#x2F;requirements.txt (line 6)) Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;6d&#x2F;d2&#x2F;0ccd2c0e2cd93b35e765d9b3205cd6602e6b202b522fc7997531353715b3&#x2F;MarkupSafe-1.1.1-cp27-cp27m-macosx_10_6_intel.whlCollecting python-dateutil&#x3D;&#x3D;2.8.0 (from -r &#x2F;tmp&#x2F;requirements.txt (line 7)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;41&#x2F;17&#x2F;c62faccbfbd163c7f57f3844689e3a78bae1f403648a6afb1d0866d87fbb&#x2F;python_dateutil-2.8.0-py2.py3-none-any.whlCollecting six&#x3D;&#x3D;1.12.0 (from -r &#x2F;tmp&#x2F;requirements.txt (line 8)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;73&#x2F;fb&#x2F;00a976f728d0d1fecfe898238ce23f502a721c0ac0ecfedb80e0d88c64e9&#x2F;six-1.12.0-py2.py3-none-any.whlCollecting Werkzeug&#x3D;&#x3D;0.14.1 (from -r &#x2F;tmp&#x2F;requirements.txt (line 9)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;20&#x2F;c4&#x2F;12e3e56473e52375aa29c4764e70d1b8f3efa6682bef8d0aae04fe335243&#x2F;Werkzeug-0.14.1-py2.py3-none-any.whlCollecting backports.functools-lru-cache&gt;&#x3D;1.2.1; python_version &#x3D;&#x3D; &quot;2.7&quot; (from arrow&#x3D;&#x3D;0.13.1-&gt;-r &#x2F;tmp&#x2F;requirements.txt (line 1)) Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;03&#x2F;8e&#x2F;2424c0e65c4a066e28f539364deee49b6451f8fcd4f718fefa50cc3dcf48&#x2F;backports.functools_lru_cache-1.5-py2.py3-none-any.whlInstalling collected packages: six, python-dateutil, backports.functools-lru-cache, arrow, Click, MarkupSafe, Jinja2, itsdangerous, Werkzeug, FlaskSuccessfully installed Click-7.0 Flask-1.0.2 Jinja2-2.10 MarkupSafe-1.1.1 Werkzeug-0.14.1 arrow-0.13.1 backports.functools-lru-cache-1.5 itsdangerous-1.1.0 python-dateutil-2.8.0 six-1.12.0 Pip freeze, will confirm that the Python 2 environment has the same versions installed as the Python 3 environment and is almost identical to what we saw previously. The version 2 equivalent also required a dependency of ‘backports.functools-lru-cache==1.5’ hence an additional module - (python2venv) $ pip freezeDEPRECATION: Python 2.7 will reach the end of its life on January 1st, 2020. Please upgrade your Python as Python 2.7 won&#39;t be maintained after that date. A future version of pip will drop support for Python 2.7.arrow&#x3D;&#x3D;0.13.1backports.functools-lru-cache&#x3D;&#x3D;1.5Click&#x3D;&#x3D;7.0Flask&#x3D;&#x3D;1.0.2itsdangerous&#x3D;&#x3D;1.1.0Jinja2&#x3D;&#x3D;2.10MarkupSafe&#x3D;&#x3D;1.1.1python-dateutil&#x3D;&#x3D;2.8.0six&#x3D;&#x3D;1.12.0Werkzeug&#x3D;&#x3D;0.14.1 Whilst I don’t necessarily recommend switching virtual environments between Python versions, the example was chosen to show the versitiliy of the pip freeze command and the ability, to replay an environment, albeit into the same version of a virtual environment, or another version whether major, or minor. Using a Virtual Environment, without activationEarlier, I made reference that it’s convenient, to activate a virtual environment but, in some cases, it’s also convenient not to activate it. For example, you may wish to call a script or application direct. The python binary, in the virtual environment can be called directly and existing search paths are honoured. For example, if we call the binary direct without any virtualenv, we can still import the modules we’ve installed without error - (python2venv) $ deactivate$ python3venv&#x2F;bin&#x2F;pythonPython 3.6.4 (v3.6.4:d48ecebad5, Dec 18 2017, 21:07:28)[GCC 4.2.1 (Apple Inc. build 5666) (dot 3)] on darwinType &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more information.&gt;&gt;&gt; import arrow&gt;&gt;&gt; print(arrow)&lt;module &#39;arrow&#39; from &#39;&#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;arrow&#x2F;__init__.py&#39;&gt;&gt;&gt;&gt; ^D$ python2venv&#x2F;bin&#x2F;pythonPython 2.7.14 (v2.7.14:84471935ed, Sep 16 2017, 12:01:12)[GCC 4.2.1 (Apple Inc. build 5666) (dot 3)] on darwinType &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more information.&gt;&gt;&gt; import arrow&gt;&gt;&gt; print(arrow)&lt;module &#39;arrow&#39; from &#39;&#x2F;Users&#x2F;james&#x2F;python2venv&#x2F;lib&#x2F;python2.7&#x2F;site-packages&#x2F;arrow&#x2F;__init__.pyc&#39;&gt;&gt;&gt;&gt; ^D Our scripts can also use the #! directive, making direct reference to the python binary, if we create a quick script - $ cat &lt;&lt;EOF &gt; test.py&gt; #!&#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;bin&#x2F;python&gt;&gt; import arrow&gt; utc &#x3D; arrow.utcnow()&gt; print(utc)&gt; EOF Set executable, and execute, we can confirm that modules within the venv are honoured - $ chmod u+x test.py$ .&#x2F;test.py2019-03-03T21:17:22.632130+00:00 Making it highly convenient for a script or application, to run with the specific requirements that are needed. Packaging and re-useWith a virtual environment configured, it’s possible to package an entire virtual environment, and use it as an execution base providing that the target installation has the same version of Python that was used to create the virtual environment and that the virtual environment is placed in the same location. This is very convenient, when working in environments that have standardised builds. Essentially, the whole environment can be packaged and deployed to another system. To quickly demonstrate, take a dump of the virtual env $ tar cf python3venv.tar python3venv Destroy the venv - $ rm -rf python3venv Extract the dump - $ tar xf python3venv.tar Test a dependent script - $ .&#x2F;test.py2019-03-03T21:26:47.082092+00:00 Using pip-tools to manage Virtual EnvironmentsPersonally, I am a big fan of pip-tools, it provides a great way, of managing and maintaining virtual environments and their dependencies. From the examples above, we saw that the installation of both arrow and flask, resulted in a number of dependent modules. If for example we now remove both arrow and flask, the dependencies, remain in the virtual environment - (python3venv) $ pip uninstall arrow flaskUninstalling arrow-0.13.1: Would remove: &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;arrow-0.13.1.dist-info&#x2F;* &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;arrow&#x2F;*Proceed (y&#x2F;n)? y Successfully uninstalled arrow-0.13.1Uninstalling Flask-1.0.2: Would remove: &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;bin&#x2F;flask &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;Flask-1.0.2.dist-info&#x2F;* &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;flask&#x2F;*Proceed (y&#x2F;n)? y Successfully uninstalled Flask-1.0.2 (python3venv) $ pip freezeClick&#x3D;&#x3D;7.0itsdangerous&#x3D;&#x3D;1.1.0Jinja2&#x3D;&#x3D;2.10MarkupSafe&#x3D;&#x3D;1.1.1python-dateutil&#x3D;&#x3D;2.8.0six&#x3D;&#x3D;1.12.0Werkzeug&#x3D;&#x3D;0.14.1 Through the use of pip-tools, there is a cleaner way. If we start with a fresh virtual environment and install pip-tools - (python3venv) $ deactivate$ rm -rf python3venv$ python3 -mvenv python3venv$ source python3venv&#x2F;bin&#x2F;activate(python3venv) $ pip install --upgrade pipCache entry deserialization failed, entry ignoredCollecting pip Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;d8&#x2F;f3&#x2F;413bab4ff08e1fc4828dfc59996d721917df8e8583ea85385d51125dceff&#x2F;pip-19.0.3-py2.py3-none-any.whlInstalling collected packages: pip Found existing installation: pip 9.0.1 Uninstalling pip-9.0.1: Successfully uninstalled pip-9.0.1Successfully installed pip-19.0.3(python3venv) $ pip install pip-toolsCollecting pip-tools Downloading https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;58&#x2F;7a&#x2F;f93b24807b7ac2d9d0bd6b8a886bcbe67eb39c1b1184b985dd5e0e2eca92&#x2F;pip_tools-3.4.0-py2.py3-none-any.whl (43kB) 100% |████████████████████████████████| 51kB 2.3MB&#x2F;sCollecting six (from pip-tools) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;73&#x2F;fb&#x2F;00a976f728d0d1fecfe898238ce23f502a721c0ac0ecfedb80e0d88c64e9&#x2F;six-1.12.0-py2.py3-none-any.whlCollecting click&gt;&#x3D;6 (from pip-tools) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;fa&#x2F;37&#x2F;45185cb5abbc30d7257104c434fe0b07e5a195a6847506c074527aa599ec&#x2F;Click-7.0-py2.py3-none-any.whlInstalling collected packages: six, click, pip-toolsSuccessfully installed click-7.0 pip-tools-3.4.0 six-1.12.0 We can now use an input file to track requirements. In this case, I’m going to create a requirements.in file, and I will implicitly put the versions of arrow and flask that I am interested in (python3venv) $ cat &lt;&lt;EOF &gt; requirements.in&gt; arrow&#x3D;&#x3D;0.13.1&gt; Flask&#x3D;&#x3D;1.0.2&gt; EOF Using pip-compile, part of the pip-tools suite, we can create our requirements.txt from the requirements.in (python3venv) $ pip-compile --generate-hashes --output-file requirements.txt requirements.in## This file is autogenerated by pip-compile# To update, run:## pip-compile --generate-hashes --output-file requirements.txt requirements.in#arrow&#x3D;&#x3D;0.13.1 \\ --hash&#x3D;sha256:3397e5448952e18e1295bf047014659effa5ae8da6a5371d37ff0ddc46fa6872 \\ --hash&#x3D;sha256:6f54d9f016c0b7811fac9fb8c2c7fa7421d80c54dbdd75ffb12913c55db60b8aclick&#x3D;&#x3D;7.0 \\ --hash&#x3D;sha256:2335065e6395b9e67ca716de5f7526736bfa6ceead690adf616d925bdc622b13 \\ --hash&#x3D;sha256:5b94b49521f6456670fdb30cd82a4eca9412788a93fa6dd6df72c94d5a8ff2d7 \\ # via flaskflask&#x3D;&#x3D;1.0.2 \\ --hash&#x3D;sha256:2271c0070dbcb5275fad4a82e29f23ab92682dc45f9dfbc22c02ba9b9322ce48 \\ --hash&#x3D;sha256:a080b744b7e345ccfcbc77954861cb05b3c63786e93f2b3875e0913d44b43f05itsdangerous&#x3D;&#x3D;1.1.0 \\ --hash&#x3D;sha256:321b033d07f2a4136d3ec762eac9f16a10ccd60f53c0c91af90217ace7ba1f19 \\ --hash&#x3D;sha256:b12271b2047cb23eeb98c8b5622e2e5c5e9abd9784a153e9d8ef9cb4dd09d749 \\ # via flaskjinja2&#x3D;&#x3D;2.10 \\ --hash&#x3D;sha256:74c935a1b8bb9a3947c50a54766a969d4846290e1e788ea44c1392163723c3bd \\ --hash&#x3D;sha256:f84be1bb0040caca4cea721fcbbbbd61f9be9464ca236387158b0feea01914a4 \\ # via flaskmarkupsafe&#x3D;&#x3D;1.1.1 \\ --hash&#x3D;sha256:00bc623926325b26bb9605ae9eae8a215691f33cae5df11ca5424f06f2d1f473 \\ --hash&#x3D;sha256:09027a7803a62ca78792ad89403b1b7a73a01c8cb65909cd876f7fcebd79b161 \\ --hash&#x3D;sha256:09c4b7f37d6c648cb13f9230d847adf22f8171b1ccc4d5682398e77f40309235 \\ --hash&#x3D;sha256:1027c282dad077d0bae18be6794e6b6b8c91d58ed8a8d89a89d59693b9131db5 \\ --hash&#x3D;sha256:24982cc2533820871eba85ba648cd53d8623687ff11cbb805be4ff7b4c971aff \\ --hash&#x3D;sha256:29872e92839765e546828bb7754a68c418d927cd064fd4708fab9fe9c8bb116b \\ --hash&#x3D;sha256:43a55c2930bbc139570ac2452adf3d70cdbb3cfe5912c71cdce1c2c6bbd9c5d1 \\ --hash&#x3D;sha256:46c99d2de99945ec5cb54f23c8cd5689f6d7177305ebff350a58ce5f8de1669e \\ --hash&#x3D;sha256:500d4957e52ddc3351cabf489e79c91c17f6e0899158447047588650b5e69183 \\ --hash&#x3D;sha256:535f6fc4d397c1563d08b88e485c3496cf5784e927af890fb3c3aac7f933ec66 \\ --hash&#x3D;sha256:62fe6c95e3ec8a7fad637b7f3d372c15ec1caa01ab47926cfdf7a75b40e0eac1 \\ --hash&#x3D;sha256:6dd73240d2af64df90aa7c4e7481e23825ea70af4b4922f8ede5b9e35f78a3b1 \\ --hash&#x3D;sha256:717ba8fe3ae9cc0006d7c451f0bb265ee07739daf76355d06366154ee68d221e \\ --hash&#x3D;sha256:79855e1c5b8da654cf486b830bd42c06e8780cea587384cf6545b7d9ac013a0b \\ --hash&#x3D;sha256:7c1699dfe0cf8ff607dbdcc1e9b9af1755371f92a68f706051cc8c37d447c905 \\ --hash&#x3D;sha256:88e5fcfb52ee7b911e8bb6d6aa2fd21fbecc674eadd44118a9cc3863f938e735 \\ --hash&#x3D;sha256:8defac2f2ccd6805ebf65f5eeb132adcf2ab57aa11fdf4c0dd5169a004710e7d \\ --hash&#x3D;sha256:98c7086708b163d425c67c7a91bad6e466bb99d797aa64f965e9d25c12111a5e \\ --hash&#x3D;sha256:9add70b36c5666a2ed02b43b335fe19002ee5235efd4b8a89bfcf9005bebac0d \\ --hash&#x3D;sha256:9bf40443012702a1d2070043cb6291650a0841ece432556f784f004937f0f32c \\ --hash&#x3D;sha256:ade5e387d2ad0d7ebf59146cc00c8044acbd863725f887353a10df825fc8ae21 \\ --hash&#x3D;sha256:b00c1de48212e4cc9603895652c5c410df699856a2853135b3967591e4beebc2 \\ --hash&#x3D;sha256:b1282f8c00509d99fef04d8ba936b156d419be841854fe901d8ae224c59f0be5 \\ --hash&#x3D;sha256:b2051432115498d3562c084a49bba65d97cf251f5a331c64a12ee7e04dacc51b \\ --hash&#x3D;sha256:ba59edeaa2fc6114428f1637ffff42da1e311e29382d81b339c1817d37ec93c6 \\ --hash&#x3D;sha256:c8716a48d94b06bb3b2524c2b77e055fb313aeb4ea620c8dd03a105574ba704f \\ --hash&#x3D;sha256:cd5df75523866410809ca100dc9681e301e3c27567cf498077e8551b6d20e42f \\ --hash&#x3D;sha256:e249096428b3ae81b08327a63a485ad0878de3fb939049038579ac0ef61e17e7 \\ # via jinja2python-dateutil&#x3D;&#x3D;2.8.0 \\ --hash&#x3D;sha256:7e6584c74aeed623791615e26efd690f29817a27c73085b78e4bad02493df2fb \\ --hash&#x3D;sha256:c89805f6f4d64db21ed966fda138f8a5ed7a4fdbc1a8ee329ce1b74e3c74da9e \\ # via arrowsix&#x3D;&#x3D;1.12.0 \\ --hash&#x3D;sha256:3350809f0555b11f552448330d0b52d5f24c91a322ea4a15ef22629740f3761c \\ --hash&#x3D;sha256:d16a0141ec1a18405cd4ce8b4613101da75da0e9a7aec5bdd4fa804d0e0eba73 \\ # via python-dateutilwerkzeug&#x3D;&#x3D;0.14.1 \\ --hash&#x3D;sha256:c3fd7a7d41976d9f44db327260e263132466836cef6f91512889ed60ad26557c \\ --hash&#x3D;sha256:d5da73735293558eb1651ee2fddc4d0dedcfa06538b8813a2e20011583c9e49b \\ # via flask The clear benefit of this approach, is that the dependencies also have hashes to ensure consistency of the desired modules. Running pip-sync, again, part of the pip-tools suite will synchronise our virtual environment with that of the requirements.txt file (python3venv) $ pip-syncCollecting arrow&#x3D;&#x3D;0.13.1 (from -r &#x2F;var&#x2F;folders&#x2F;xk&#x2F;p46swdnn3b56rbd01qwdjhdh0000gn&#x2F;T&#x2F;tmpfwkk4j83 (line 1)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;f4&#x2F;7f&#x2F;0360628ba40bb93c10cd89cd289b6a8e9ea87b2db884b8edf32c80ee1c73&#x2F;arrow-0.13.1-py2.py3-none-any.whlCollecting flask&#x3D;&#x3D;1.0.2 (from -r &#x2F;var&#x2F;folders&#x2F;xk&#x2F;p46swdnn3b56rbd01qwdjhdh0000gn&#x2F;T&#x2F;tmpfwkk4j83 (line 4)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;7f&#x2F;e7&#x2F;08578774ed4536d3242b14dacb4696386634607af824ea997202cd0edb4b&#x2F;Flask-1.0.2-py2.py3-none-any.whlCollecting itsdangerous&#x3D;&#x3D;1.1.0 (from -r &#x2F;var&#x2F;folders&#x2F;xk&#x2F;p46swdnn3b56rbd01qwdjhdh0000gn&#x2F;T&#x2F;tmpfwkk4j83 (line 7)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;76&#x2F;ae&#x2F;44b03b253d6fade317f32c24d100b3b35c2239807046a4c953c7b89fa49e&#x2F;itsdangerous-1.1.0-py2.py3-none-any.whlCollecting jinja2&#x3D;&#x3D;2.10 (from -r &#x2F;var&#x2F;folders&#x2F;xk&#x2F;p46swdnn3b56rbd01qwdjhdh0000gn&#x2F;T&#x2F;tmpfwkk4j83 (line 10)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;7f&#x2F;ff&#x2F;ae64bacdfc95f27a016a7bed8e8686763ba4d277a78ca76f32659220a731&#x2F;Jinja2-2.10-py2.py3-none-any.whlCollecting markupsafe&#x3D;&#x3D;1.1.1 (from -r &#x2F;var&#x2F;folders&#x2F;xk&#x2F;p46swdnn3b56rbd01qwdjhdh0000gn&#x2F;T&#x2F;tmpfwkk4j83 (line 13)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;f0&#x2F;00&#x2F;a6aea33f5598b080b86d6b6d1214b51afe3ffa6100b902d5aa465080083f&#x2F;MarkupSafe-1.1.1-cp36-cp36m-macosx_10_6_intel.whlCollecting python-dateutil&#x3D;&#x3D;2.8.0 (from -r &#x2F;var&#x2F;folders&#x2F;xk&#x2F;p46swdnn3b56rbd01qwdjhdh0000gn&#x2F;T&#x2F;tmpfwkk4j83 (line 42)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;41&#x2F;17&#x2F;c62faccbfbd163c7f57f3844689e3a78bae1f403648a6afb1d0866d87fbb&#x2F;python_dateutil-2.8.0-py2.py3-none-any.whlCollecting werkzeug&#x3D;&#x3D;0.14.1 (from -r &#x2F;var&#x2F;folders&#x2F;xk&#x2F;p46swdnn3b56rbd01qwdjhdh0000gn&#x2F;T&#x2F;tmpfwkk4j83 (line 45)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;20&#x2F;c4&#x2F;12e3e56473e52375aa29c4764e70d1b8f3efa6682bef8d0aae04fe335243&#x2F;Werkzeug-0.14.1-py2.py3-none-any.whlRequirement already satisfied: click&gt;&#x3D;5.1 in .&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages (from flask&#x3D;&#x3D;1.0.2-&gt;-r &#x2F;var&#x2F;folders&#x2F;xk&#x2F;p46swdnn3b56rbd01qwdjhdh0000gn&#x2F;T&#x2F;tmpfwkk4j83 (line 4)) (7.0)Requirement already satisfied: six&gt;&#x3D;1.5 in .&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages (from python-dateutil&#x3D;&#x3D;2.8.0-&gt;-r &#x2F;var&#x2F;folders&#x2F;xk&#x2F;p46swdnn3b56rbd01qwdjhdh0000gn&#x2F;T&#x2F;tmpfwkk4j83 (line 42)) (1.12.0)Installing collected packages: python-dateutil, arrow, werkzeug, itsdangerous, markupsafe, jinja2, flaskSuccessfully installed arrow-0.13.1 flask-1.0.2 itsdangerous-1.1.0 jinja2-2.10 markupsafe-1.1.1 python-dateutil-2.8.0 werkzeug-0.14.1 (python3venv) $ pip freezearrow&#x3D;&#x3D;0.13.1Click&#x3D;&#x3D;7.0Flask&#x3D;&#x3D;1.0.2itsdangerous&#x3D;&#x3D;1.1.0Jinja2&#x3D;&#x3D;2.10MarkupSafe&#x3D;&#x3D;1.1.1pip-tools&#x3D;&#x3D;3.4.0python-dateutil&#x3D;&#x3D;2.8.0six&#x3D;&#x3D;1.12.0Werkzeug&#x3D;&#x3D;0.14.1 Should however we wish to remove a component, for example Flask, we can update our requirements.in. When we repeat the process with pip-sync, it will remove Flask as well as Flask’s dependencies - (python3venv) $ cat &lt;&lt;EOF &gt; requirements.in&gt; arrow&#x3D;&#x3D;0.13.1&gt; EOF (python3venv) $ pip-compile --generate-hashes --output-file requirements.txt requirements.in## This file is autogenerated by pip-compile# To update, run:## pip-compile --generate-hashes --output-file requirements.txt requirements.in#arrow&#x3D;&#x3D;0.13.1 \\ --hash&#x3D;sha256:3397e5448952e18e1295bf047014659effa5ae8da6a5371d37ff0ddc46fa6872 \\ --hash&#x3D;sha256:6f54d9f016c0b7811fac9fb8c2c7fa7421d80c54dbdd75ffb12913c55db60b8apython-dateutil&#x3D;&#x3D;2.8.0 \\ --hash&#x3D;sha256:7e6584c74aeed623791615e26efd690f29817a27c73085b78e4bad02493df2fb \\ --hash&#x3D;sha256:c89805f6f4d64db21ed966fda138f8a5ed7a4fdbc1a8ee329ce1b74e3c74da9e \\ # via arrowsix&#x3D;&#x3D;1.12.0 \\ --hash&#x3D;sha256:3350809f0555b11f552448330d0b52d5f24c91a322ea4a15ef22629740f3761c \\ --hash&#x3D;sha256:d16a0141ec1a18405cd4ce8b4613101da75da0e9a7aec5bdd4fa804d0e0eba73 \\ # via python-dateutil (python3venv) $ pip-syncUninstalling Flask-1.0.2: Successfully uninstalled Flask-1.0.2Uninstalling itsdangerous-1.1.0: Successfully uninstalled itsdangerous-1.1.0Uninstalling Jinja2-2.10: Successfully uninstalled Jinja2-2.10Uninstalling MarkupSafe-1.1.1: Successfully uninstalled MarkupSafe-1.1.1Uninstalling Werkzeug-0.14.1: Successfully uninstalled Werkzeug-0.14.1 (python3venv) $ pip freezearrow&#x3D;&#x3D;0.13.1Click&#x3D;&#x3D;7.0pip-tools&#x3D;&#x3D;3.4.0python-dateutil&#x3D;&#x3D;2.8.0six&#x3D;&#x3D;1.12.0 Using your Virtual Environment with a Specific PyPi RepositoryIn some circumstances, you may have a requirement to use a specific PyPi repository for installation. Should this be the case, the creation of a file called pip.conf, in the root of the Virtual Environment is enough to satisfy this dependency. An example pip.conf looks like the following, change hostname.spurin.com as required - [global]disable-pip-version-check &#x3D; Truetrusted-host &#x3D; hostname.spurin.comindex &#x3D; https:&#x2F;&#x2F;hostname.spurin.com&#x2F;repository&#x2F;pypi-all&#x2F;pypiindex-url &#x3D; https:&#x2F;&#x2F;hostname.spurin.com&#x2F;repository&#x2F;pypi-all&#x2F;simple Isolating Module VersionsVirtual Environments are a great way of isolating, specific versions of modules. Over time you may have a project, that has dependencies on a specific version whilst another, may benefit from newer functionality. A particular module where this isolation is effective in Ansible and in the course that I created, Mastering Ansible, my preferred approach for installing Ansible is via a Virtual Environment. You can be specific with the version of Ansible that you install, can choose whether or not you leverage Python 2 or Python 3 (historically, Python 2 is a more reliable choice with Ansible) and you can have multiple versions of Ansible on the same system. The following diagram from the course demonstrates the effectiveness, of Virtual Environments - Creating Wheels from your Virtual EnvironmentWheel can be used to capture Python modules into zip like files that can be conveniently used for installations. They even handle complicated Python packages that require compilation (C extensions). Using such an approach, allows you to facilitate installations from one machine that has a compiler to another that may not. (python3venv) $ pip wheel --wheel-dir&#x3D;&#x2F;tmp&#x2F;wheel-dir -r requirements.txtCollecting arrow&#x3D;&#x3D;0.13.1 (from -r requirements.txt (line 7)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;f4&#x2F;7f&#x2F;0360628ba40bb93c10cd89cd289b6a8e9ea87b2db884b8edf32c80ee1c73&#x2F;arrow-0.13.1-py2.py3-none-any.whl Saved &#x2F;private&#x2F;tmp&#x2F;wheel-dir&#x2F;arrow-0.13.1-py2.py3-none-any.whlCollecting python-dateutil&#x3D;&#x3D;2.8.0 (from -r requirements.txt (line 10)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;41&#x2F;17&#x2F;c62faccbfbd163c7f57f3844689e3a78bae1f403648a6afb1d0866d87fbb&#x2F;python_dateutil-2.8.0-py2.py3-none-any.whl Saved &#x2F;private&#x2F;tmp&#x2F;wheel-dir&#x2F;python_dateutil-2.8.0-py2.py3-none-any.whlCollecting six&#x3D;&#x3D;1.12.0 (from -r requirements.txt (line 14)) Using cached https:&#x2F;&#x2F;files.pythonhosted.org&#x2F;packages&#x2F;73&#x2F;fb&#x2F;00a976f728d0d1fecfe898238ce23f502a721c0ac0ecfedb80e0d88c64e9&#x2F;six-1.12.0-py2.py3-none-any.whl Saved &#x2F;private&#x2F;tmp&#x2F;wheel-dir&#x2F;six-1.12.0-py2.py3-none-any.whl (python3venv) $ ls &#x2F;tmp&#x2F;wheel-dirarrow-0.13.1-py2.py3-none-any.whl python_dateutil-2.8.0-py2.py3-none-any.whl six-1.12.0-py2.py3-none-any.whl (python3venv) $ pip uninstall arrow python_dateutil sixUninstalling arrow-0.13.1: Would remove: &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;arrow-0.13.1.dist-info&#x2F;* &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;arrow&#x2F;*Proceed (y&#x2F;n)? y Successfully uninstalled arrow-0.13.1Uninstalling python-dateutil-2.8.0: Would remove: &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;dateutil&#x2F;* &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;python_dateutil-2.8.0.dist-info&#x2F;*Proceed (y&#x2F;n)? y Successfully uninstalled python-dateutil-2.8.0Uninstalling six-1.12.0: Would remove: &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;six-1.12.0.dist-info&#x2F;* &#x2F;Users&#x2F;james&#x2F;python3venv&#x2F;lib&#x2F;python3.6&#x2F;site-packages&#x2F;six.pyProceed (y&#x2F;n)? y Successfully uninstalled six-1.12.0 (python3venv) $ pip install --find-links&#x3D;&#x2F;tmp&#x2F;wheel-dir -r requirements.txtLooking in links: &#x2F;tmp&#x2F;wheel-dirCollecting arrow&#x3D;&#x3D;0.13.1 (from -r requirements.txt (line 7))Collecting python-dateutil&#x3D;&#x3D;2.8.0 (from -r requirements.txt (line 10))Collecting six&#x3D;&#x3D;1.12.0 (from -r requirements.txt (line 14))Installing collected packages: six, python-dateutil, arrowSuccessfully installed arrow-0.13.1 python-dateutil-2.8.0 six-1.12.0 Closing remarksThis post, covers a lot of the use cases for how I personally use virtual environment and the traditional approach for setup and use. There are as to be expected with a topic such as this, a multitude of a ways of managing and maintaining your own virtual environments. A popular module at the moment is Kenneth Reitz pipenv. It is an excellent module and as per his other endeavours, it has been met with significant praise. There is however a flip side to it’s use and both the article by Chris Warrick and the subsequent discussion in the hacker news thread provide another viewpoint. I recommend both trying the module for yourself and reading the counter arguments. Personally, I think of pipenv as a fantastic tool for personal development and if your development cycle is more aligned to that approach then take a look. When working in a shared environment, having been a long time pip user prior to the release of pipenv, I’m personally happier with the approaches that I’ve outlined above. YMMV :-)","categories":[],"tags":[{"name":"Tutorial","slug":"Tutorial","permalink":"http://spurin.com/tags/Tutorial/"},{"name":"Python","slug":"Python","permalink":"http://spurin.com/tags/Python/"},{"name":"Python 2","slug":"Python-2","permalink":"http://spurin.com/tags/Python-2/"},{"name":"Python 3","slug":"Python-3","permalink":"http://spurin.com/tags/Python-3/"},{"name":"Virtual Environments","slug":"Virtual-Environments","permalink":"http://spurin.com/tags/Virtual-Environments/"}],"author":"James Spurin"},{"title":"MasteringAnsible.com Launched","slug":"MasteringAnsible-com-Launched","date":"2019-03-10T15:25:00.000Z","updated":"2019-03-10T15:13:57.000Z","comments":true,"path":"2019/03/10/MasteringAnsible-com-Launched/","link":"","permalink":"http://spurin.com/2019/03/10/MasteringAnsible-com-Launched/","excerpt":"","text":"Today I’ve launched masteringansible.com as per my previous post which outlines the process of how I created the site (using Hexo, Hexo-Admin, Hueman Theme, Docker and Github). The site acts as main reference for the course with different locations that it can be purchased (shop around if you’re interested, one option may be more cost effective than another). It will contain updates to the course that reference issues, individuals may have had, future changes, course updates and general Ansible news.","categories":[],"tags":[{"name":"Ansible","slug":"Ansible","permalink":"http://spurin.com/tags/Ansible/"}],"author":"James Spurin"},{"title":"Introduction","slug":"Introduction","date":"2019-03-02T16:44:00.000Z","updated":"2020-01-03T00:35:07.000Z","comments":true,"path":"2019/03/02/Introduction/","link":"","permalink":"http://spurin.com/2019/03/02/Introduction/","excerpt":"","text":"Hello and welcome to the personal site of James Spurin, those of you here may know me for a variety of different reasons. I’ve created this site as a soundboard for different areas that are of interest. TechnologySince being in single digits, I’ve been into technology and my older brother’s rule of not being allowed to touch the ZX Spectrum was soon bypassed with the use of my grandmothers fingers as a ‘proxy’ to the keyboard. This passion continued throughout my youth, building computers at a young age and exploring all aspects of computing that I could find. In 1997, I started my professional career at Virgin Internet. Since then I’ve worked in a multitude of companies including Nomura, Goldman Sachs and even Lehman Brothers (leaving weeks before the collapse). I missed the University venture whilst I was young and instead, invested my time in a working career and the opportunities that were available within my vicinity, mostly professional courses and professional qualifications. This approach served me well and during which, I achieved the highest of certifications from companies such as Dell EMC, Sun Microsystems, HP and IBM. I still however, had a yearn for a University education. In 2007, I contacted the University of Liverpool after seeing an online advert for an online Masters programme that they were offering. My gut instinct was that this wouldn’t go too far given that my highest academic qualification at the time was a humble 8 GCSE’s. After a lengthy discussion I was asked to summarise my work qualifications and it was put to the board of Liverpool University for review. A few weeks went by and I was fortunate to be accepted onto the programme under a caveat that my progress would be reviewed for the first three modules, essentially, I was on probation. In 2010, I graduated with an MSc with Distinction in Computer Science - Software Engineering and was one of a handful to achieve the highest level for the programme. After learning a respectable means of software development than the self taught approach that I previously relied on, I became more involved in Open Source development and contribution. I developed an XML parser in Perl which was featured on perl.com - And later ported it to Python as xmldataset, where it made the Awesome Python list - I’ve contributed to other Open Source projects ranging from Synergy to ActiveMQ. Personally, I’m passionate about technology, whether its Software Development, Cryptocurrency, Automation, Storage, Cloud Computing, Kubernetes, Containers or anything else. More recently, wanting to pass on the benefit of knowledge and education, at the start of 2018 I created my first online course with ‘Packt Publishing’ called ‘Mastering Ansible’. It went on to become a best seller, has had over 5000 students and brought about a network of new friends. The course took me 3 months to write and is 11.5 hours, I’ll be talking about this both from a technical viewpoint and from a course development perspective. Disability‘I am Disabled’, a quote which for years I struggled with but have now got to grips with. It took a long time but eventually I managed to follow the motto of Henry Fraser and embrace his mantra of ‘Accept and Adapt’. I was moved by his resilience and motto and even bought the T-Shirt. For me the disability path was very difficult having experienced Disability Discrimination from a young age. I have an older brother as mentioned who’s disability started at 5 years old. With kids being kids, the use of Spastic and our surname was ingeniously put together on many occasions as an unsophisticated taunt. At the time I didn’t have a disability but that doesn’t mitigate this abuse. I was fine up until I was about 30 years old and then, I started catching my legs more and more often. I had, unfortunately injured my ankle after being too merry with friends and expected this to be a simple injury. You don’t really expect to be told that you have a type of Motor Neurone Disease called Hereditary Spastic Paraparesis. The condition I had seen in my brother turned out to be Hereditary. Whilst his diagnosis was Cerebral Palsy, my Neurologists believed that it was more likely to be HSP like my own. As time progressed, the disability progressed from the point where I would receive a question such as ‘have you hurt your leg’ to ‘do you have a limp’, then, to ‘have you had polio’ and ‘whats your disability’. At present I walk with a difficult gait. For years I studied this disease and learnt every aspect I could about it, mostly in the hope for a cure or some way out of this predicament. Unfortunately, with this disease it is something that you manage, there is no ‘cure’. On these pages I’ll be writing about this experience, how individuals in the same predicament can effectively manage their diagnosis, steps to ensure they get the most accurate diagnosis and options for managing the condition. There will be topics such as Disability Discrimination and the lighter side, of how to actually communicate with people effectively about disabilities (hint, humour is a great tool!). Selective Dorsal RhizotomyThis is one of the areas outside of technology that I am most passionate about in life and relates heavily to the topic of disability that I’ve detailed above. As highlighted, there is no cure at present for HSP (Hereditary Spastic Paraparesis) or conditions with similar pathologies such as Cerebral Palsy, but, the treatment of SDR (Selective Dorsal Rhizotomy) is a fantastic option and brings much benefit to the overall life quality of those disabled with either HSP or CP. Whilst the treatment has been available for Cerebral Palsy for a long time, it is now available also to those with the Pure form of Hereditary Spastic Paraparesis. I am the 22nd person in the world to receive this treatment for HSP in St Louis and am not aware, of any other hospitals that currently facilitate this, for HSP. Autism Spectrum Disorder &amp; Sensory Processing DisorderWorking in IT, I have a number of friends who have been diagnosed with a type of Autism Spectrum Disorder (formerly referred to as Aspergers). In an effort to be the best for them, I’ve researched and learnt about this and in time, have helped some overcome difficulties they faced in both general life and work. I also, have a daughter who has a rare type of ASD known as Sensory Processing Disorder, a subtype that is well researched and recognised in America but less so here in the UK. Through both research and time spent in America, we’ve learnt some valuable lessons and approaches for supporting the condition. Lastly, my wife, the real expert on this is undergoing her PhD in Child Psychology with an emphasis on Autism Spectrum Disorders so am regularly discussing a variety of areas in this space. Shoe MakingPrior to my disability and still somewhat, I have always had an eye and passion for footwear. In my younger years as an avid Oliver Sweeney fan, I would on most weekends, visit their lesser known Hammersmith shop looking to snap up pairs at a discount price. One day, whilst eating a Katsu Curry with a good friend, I saw a statue of a Cordweiner with a description plaque. It caught my attention and I wondered if there was anywhere in London that you could still learn this trade. I came across Paul Thomas Shoes and signed up for classes. Fearful of stepping into the world of elite fashion designers, I went along to a class to see how I faired (an IT person with zero fashion skills) … I loved it. After four years of part time work (2 hours per week), listening to Paul Thomas’s amazing music collection and interacting with a great crowd (an ex professional boxer who now has his own line of shoes - Tom Kilgallon, and a young lady featured in London Fashion Week - Gemma Roe). I designed and created from scratch, two pairs of shoes, which in itself was remarkable, giving the difficulties I faced with the sewing machines and my shaking legs (owing to clonus caused through spasticity from HSP). The result was these beauties. A pair of boots that I created for myself - And a pair I created for my wife, a twist on a pair that she had seen at an Edwardian museum with buttons that were taken from an old Edwardian Teddy Bear - Closing RemarksI hope you enjoy the site and for whatever reason you came here, find it useful. James Spurin","categories":[],"tags":[],"author":"James Spurin"}],"categories":[],"tags":[{"name":"Blogging","slug":"Blogging","permalink":"http://spurin.com/tags/Blogging/"},{"name":"Hexo","slug":"Hexo","permalink":"http://spurin.com/tags/Hexo/"},{"name":"Docker","slug":"Docker","permalink":"http://spurin.com/tags/Docker/"},{"name":"Github","slug":"Github","permalink":"http://spurin.com/tags/Github/"},{"name":"Blog","slug":"Blog","permalink":"http://spurin.com/tags/Blog/"},{"name":"Hosting","slug":"Hosting","permalink":"http://spurin.com/tags/Hosting/"},{"name":"HTTPS","slug":"HTTPS","permalink":"http://spurin.com/tags/HTTPS/"},{"name":"Website","slug":"Website","permalink":"http://spurin.com/tags/Website/"},{"name":"Disability","slug":"Disability","permalink":"http://spurin.com/tags/Disability/"},{"name":"HSP","slug":"HSP","permalink":"http://spurin.com/tags/HSP/"},{"name":"SDR","slug":"SDR","permalink":"http://spurin.com/tags/SDR/"},{"name":"Tutorial","slug":"Tutorial","permalink":"http://spurin.com/tags/Tutorial/"},{"name":"Python","slug":"Python","permalink":"http://spurin.com/tags/Python/"},{"name":"Python 2","slug":"Python-2","permalink":"http://spurin.com/tags/Python-2/"},{"name":"Python 3","slug":"Python-3","permalink":"http://spurin.com/tags/Python-3/"},{"name":"Virtual Environments","slug":"Virtual-Environments","permalink":"http://spurin.com/tags/Virtual-Environments/"},{"name":"Ansible","slug":"Ansible","permalink":"http://spurin.com/tags/Ansible/"}]}